[
  {
    "scene": "EXT. COLORADO MOUNTAIN (U.S.A.) - DAY - L.S.",
    "description": " Lake and Mountains.  CAMERA TRACKS FORWARD past island in lake.",
    "dialogue": []
  },
  {
    "scene": "EXT. ROAD - DAY - L.S.",
    "description": " High Angle V.W. Car moving along road - CAMERA TILTS UP with it.",
    "dialogue": []
  },
  {
    "scene": "EXT. COLORADO MOUNTAINS & ROAD - DAY - L.S.",
    "description": " Mountains and Road - V.W. Car moves away along road - CAMERA TRACKS after it. L.S.  V.W. Car moving away along road - CAMERA TRACKS after it and passes car - TRACKING FORWARD to Mountains in b.g. M.L.S. High Angle V.W. Car moves away along road - CAMERA TILTS UP with it.  Car goes into tunnel and comes out other side.  CAMERA TRACKS after car. L.S.  V.W. Car moves along road.  CAMERA TRACKS after it. Mountains in b.g. L.S. High Angle V.W. Car moving away along road.  Mountain in b.g.  CAMERA TRACKS after car. L.S. Mountain - CAMERA TRACKS IN on Hotel. Black Frames. 2.",
    "dialogue": []
  },
  {
    "scene": "INT. OVERLOOK HOTEL/LOBBY - DAY - M.L.S.",
    "description": " Jack walks L-R across Lobby.  CAMERA TRACKS BACK & PANS with him to RECEPTIONIST behind desk. JACK moves away R-L.  CAMERA PANS with him and TRACKS IN after him through Secretary's office to open door of ULLMAN's office - revealing ULLMAN seated at desk with SECRETARY standing beside him. ULLMAN stands up and hands book to SECRETARY, walking round side of desk.  JACK moves into office.  CAMERA TRACKS IN after him.  He shakes hands with ULLMAN. ULLMAN points to SECRETARY. 3. ULLMAN points to chair cam.R.  JACK sits cam.R.f.g.  ULLMAN walks behind desk. ULLMAN sits behind desk.  SUSIE walks forward to R.f.g.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Hi, I've got an appointment with Mr. Ullman.  My name is Jack Torrance."
      },
      {
        "character": "RECEPTIONIST",
        "line": "His office is the first door on the left."
      },
      {
        "character": "JACK",
        "line": "Thank you."
      },
      {
        "character": "JACK",
        "line": "Mr. Ullman?"
      },
      {
        "character": "ULLMAN",
        "line": "Yes?"
      },
      {
        "character": "JACK",
        "line": "I'm Jack Torrance."
      },
      {
        "character": "ULLMAN",
        "line": "Oh, well - come on in Jack."
      },
      {
        "character": "ULLMAN",
        "line": "Very nice to meet you."
      },
      {
        "character": "JACK",
        "line": "Nice to meet you, Mr. Ullman."
      },
      {
        "character": "ULLMAN",
        "line": "This is my secretary, Susie."
      },
      {
        "character": "SECRETARY",
        "line": "Hallo."
      },
      {
        "character": "JACK",
        "line": "Susie, how do you do?"
      },
      {
        "character": "ULLMAN",
        "line": "Have any trouble finding us?"
      },
      {
        "character": "JACK",
        "line": "Oh, no problem at all.  I made the trip in three and a half hours."
      },
      {
        "character": "ULLMAN",
        "line": "Well, that's very good time, very good.  Please sit down a minute."
      },
      {
        "character": "ULLMAN",
        "line": "JAck, just make yourself at home. Would you like some coffee?"
      },
      {
        "character": "JACK",
        "line": "Well, if you are going to have some, I wouldn't mind.  Thanks."
      },
      {
        "character": "ULLMAN",
        "line": "Susie."
      },
      {
        "character": "SECRETARY",
        "line": "Sure."
      },
      {
        "character": "ULLMAN",
        "line": "Oh, and would you ask Bill Watson to join us?"
      },
      {
        "character": "SECRETARY",
        "line": "Yes, I will."
      }
    ]
  },
  {
    "scene": "EXT. APARTMENT BUILDING/BOULDER - DAY - L.S.",
    "description": " Apartment Building - cars parked in front of it.  Mountain in b.g.  CAMERA TRACKS IN on Apartment Building.",
    "dialogue": []
  },
  {
    "scene": "INT. JACK & WENDY'S APARTMENT IN BOULDER (USA) / LIVING",
    "description": " ROOM - DAY - M.L.S. DANNY is sitting at table eating a sandwich.  WENDY sitting cam.R reading book. 4. M.S. DANNY eating sandwich. M.S. DANNY while eating sandwich wiggles forefinger of his L.hand and speaks with different voice. M.S. DANNY wiggles forefinger of L.hand and speaks with different voice. 5. M.S. DANNY wiggles forefinger of L.hand and speaks with different voice.",
    "dialogue": [
      {
        "character": "DANNY",
        "line": "Mom..."
      },
      {
        "character": "WENDY",
        "line": "Yeah."
      },
      {
        "character": "DANNY",
        "line": "Do you really want to go and live in that hotel for the winter?"
      },
      {
        "character": "WENDY",
        "line": "Sure, Danny, it will be lots of fun."
      },
      {
        "character": "DANNY",
        "line": "Yeah, I guess so.  Anyway, there's hardly anybody to play with around here."
      },
      {
        "character": "WENDY",
        "line": "Yeah, I know.  It always takes a little time to make new friends."
      },
      {
        "character": "DANNY",
        "line": "Yeah, I guess so."
      },
      {
        "character": "WENDY",
        "line": "What about Tony?  He's looking forward to the hotel, I bet."
      },
      {
        "character": "TONY",
        "line": "NO, I ain't Mrs. Torrance."
      },
      {
        "character": "WENDY",
        "line": "Oh come on, Tony.  Don't be silly."
      },
      {
        "character": "TONY",
        "line": "I don't want to go there, Mrs. Torrance."
      },
      {
        "character": "WENDY",
        "line": "Well, how come you don't want to go?"
      },
      {
        "character": "TONY",
        "line": "I just don't."
      },
      {
        "character": "WENDY",
        "line": "Well, let's just wait and see. We're all gonna have a real good time."
      }
    ]
  },
  {
    "scene": "INT. OVERLOOK HOTEL/ULLMAN'S OFFICE - DAY - M.L.S.",
    "description": " JACK over ULLMAN seated at desk.  BILL WATSON enter office. JACK rises and shakes hands with him. 6. WATSON & JACK sit down. 7. M.L.S. ULLMAN over WATSON & JACK. JACK laughs. 8. ULLMAN grunts off. 9. 10. M.C.S. JACK shakes his head. 11. M.S. ULLMAN sitting behind desk. M.S. ULLMAN laughs. 12. JACK laughs. U.S. ULLMAN laughing.",
    "dialogue": [
      {
        "character": "ULLMAN",
        "line": "Bill, I'd like you to meet Jack Torrance."
      },
      {
        "character": "WATSON",
        "line": "How do you do?"
      },
      {
        "character": "JACK",
        "line": "Bill, how do you do?"
      },
      {
        "character": "WATSON",
        "line": "Pleased to meet you."
      },
      {
        "character": "JACK",
        "line": "Pleasure to meet you."
      },
      {
        "character": "ULLMAN",
        "line": "Grab a chair Bill, and join in."
      },
      {
        "character": "ULLMAN",
        "line": "Jack is going to take care of the Overlook for this winter.  I would like you to take him around the place as soon as we are through."
      },
      {
        "character": "WATSON",
        "line": "Fine."
      },
      {
        "character": "ULLMAN",
        "line": "Jack is a schoolteacher."
      },
      {
        "character": "JACK",
        "line": "Eh - formerly a school-teacher."
      },
      {
        "character": "WATSON (OFF)",
        "line": "What line of work are you in now?"
      },
      {
        "character": "JACK",
        "line": "I'm a writer um... Teaching has been more or less a way of making ends meet."
      },
      {
        "character": "WATSON",
        "line": "Well this ought to be quite a change for you."
      },
      {
        "character": "JACK",
        "line": "Well, I'm looking for a change."
      },
      {
        "character": "ULLMAN (OFF)",
        "line": "Our people in Denver recommended Jack very highly, and, for once, I agree with them."
      },
      {
        "character": "ULLMAN",
        "line": "Let's see, where were we?  Yes.  I was about to explain that eh... our season here runs from oh May 15th to October 30th and then we close down completely until the following May."
      },
      {
        "character": "JACK",
        "line": "Do you mind if I ask why you do that?  It seems to me that the skiing up here would be fantastic."
      },
      {
        "character": "ULLMAN (OFF)",
        "line": "Oh, it sure would be"
      },
      {
        "character": "ULLMAN (CONT'D)",
        "line": "but the problem is the enormous cost it would be to keep the road to the Sidewinder open.  It's a... It's a 25 mile stretch of road - gets an average of 20 feet of snow during the winter, and there's just no way to make it economically feasible to keep it clear.  When the place was built in 1907, there was very little interest in winter sports, and this site was chosen for its seclusion and scenic beauty."
      },
      {
        "character": "JACK",
        "line": "Well, it's certainly got plenty of that."
      },
      {
        "character": "ULLMAN",
        "line": "That's right.  And did they give you any idea in Denver about what the job entails?"
      },
      {
        "character": "JACK",
        "line": "Only in a very general way."
      },
      {
        "character": "ULLMAN",
        "line": "Well..."
      },
      {
        "character": "ULLMAN (CONT'D)",
        "line": "...the winters can be fantastically cruel, and the basic idea is to...to cope with the very costly damage and depreciation which can occur.  And this consists mainly of running the boiler, heating different parts of the hotel on a daily rotating basis, repairing damage as it occurs and doing repairs, so that the elements can't get a foothold."
      },
      {
        "character": "JACK",
        "line": "Well, that sounds fine to me."
      },
      {
        "character": "ULLMAN",
        "line": "Physically, it's not a very demanding job.  The only thing that can get a bit trying up here during the winter is eh... the tremendous sense of isolation."
      },
      {
        "character": "JACK",
        "line": "Well, that just happens to be exactly what I'm looking for.  I'm eh... I'm outlining a new writing project, and eh..."
      },
      {
        "character": "JACK (CONT'D)",
        "line": "five months of peace is just what I want."
      },
      {
        "character": "ULLMAN",
        "line": "That's very good Jack, because eh... for some people eh solitude and isolation..."
      },
      {
        "character": "ULLMAN (OFF) (CONT'D)",
        "line": "can of itself be a problem."
      },
      {
        "character": "JACK",
        "line": "Not for me."
      },
      {
        "character": "ULLMAN",
        "line": "How about your wife and son?  How do you think they'll take to it?"
      },
      {
        "character": "JACK",
        "line": "They'll love it."
      },
      {
        "character": "ULLMAN (OFF)",
        "line": "Great..."
      },
      {
        "character": "ULLMAN",
        "line": "Well, before I turn you over to Bill, there is one other thing I think we should talk about.  I don't want to sound melodramatic, but it is something that's..."
      },
      {
        "character": "ULLMAN (CONT'D)",
        "line": "been known to give a few people second thoughts about the job."
      },
      {
        "character": "JACK",
        "line": "I'm intrigued."
      },
      {
        "character": "ULLMAN",
        "line": "I don't suppose they eh told you anything in Denver about the tragedy we had up here during the winter of 1970?"
      },
      {
        "character": "JACK",
        "line": "I don't believe they did."
      },
      {
        "character": "ULLMAN (OFF)",
        "line": "Well, my predecessor in this job"
      },
      {
        "character": "ULLMAN (CONT'D)",
        "line": "hired a man named Charles Grady, as the winter caretaker.  He came up here with his wife and two little girls of about eight or ten.  And he had a good employment record, good references and from what I've been told, I mean, he seemed like a completely normal individual.  But at some point during the winter, he must have suffered some kind of a complete mental breakdown."
      },
      {
        "character": "ULLMAN (CONT'D)",
        "line": "He ran amok and eh... killed his family with an axe,"
      },
      {
        "character": "ULLMAN (OFF) (CONT'D)",
        "line": "stacked them neatly in one of the rooms in the West Wing, and then he um... then he put eh both barrels of his shotgun in his mouth."
      },
      {
        "character": "ULLMAN (CONT'D)",
        "line": "The police eh... they thought that it was what the old-timers used to call cabin-fever, a kind of claustrophobic reaction which can occur when people are"
      },
      {
        "character": "ULLMAN (OFF) (CONT'D)",
        "line": "shut in together over long periods of time."
      },
      {
        "character": "JACK",
        "line": "Well, that is eh quite a story."
      },
      {
        "character": "ULLMAN",
        "line": "Yes, it is.  Oh, it's still hard for me to believe that it actually happened here, but it did and eh... I think you can appreciate why I wanted to tell you about it."
      },
      {
        "character": "JACK",
        "line": "Ah, I certainly can, and eh... I also understand why your people in Denver left it for you to tell me."
      },
      {
        "character": "ULLMAN",
        "line": "Well, obviously some people can be"
      },
      {
        "character": "ULLMAN (OFF) (CONT'D)",
        "line": "put off by the idea of staying alone in a place where something like that actually happened."
      },
      {
        "character": "JACK",
        "line": "Well, you can rest assured Mr. Ullman, that's not going to happen with me, and eg as far as my wife is concerned, I am sure she'll be absolutely fascinated when I tell her about it.  She's a confirmed ghost story and horror film addict."
      }
    ]
  },
  {
    "scene": "INT. BOULDER APARTMENT/BATHROOM - DAY - M.S.",
    "description": " Shooting through open door - DANNY standing on stool at basin.",
    "dialogue": [
      {
        "character": "DANNY",
        "line": "Tony, do you think Daddy will get the job?"
      },
      {
        "character": "TONY (OFF)",
        "line": "Yeah, he did.  He's gonna phone Wendy up in a few minutes to tell her."
      }
    ]
  },
  {
    "scene": "INT. BOULDER KITCHEN/LIVING ROOM - DAY - M.S.",
    "description": " WENDY back to camera washing dishes at sink.  PHONE RINGS OFF.  She dries her hand and puts carton in fridge.  Then moves L-R into Living Room - CAMERA PANS with her. 13. She picks up telephone receiver.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "(into phone) Hello."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - LOBBY - DAY - M.L.S.",
    "description": " JACK leaning on counter at reception desk, speaking into phone.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "(into phone) Hi, babe."
      },
      {
        "character": "WENDY",
        "line": "(over phone) Hi, hon.  How's it going?"
      },
      {
        "character": "JACK",
        "line": "(into phone) Great.  Look, I'm at the hotel and I still have an awful lot to go through.  I don't think I can get home before nine or ten."
      }
    ]
  },
  {
    "scene": "INT. BOULDER APARTMENT/LIVING ROOM - DAY - M.S.",
    "description": " WENDY sitting on back of chair phone to ear.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "(into phone) Sounds like you got the job?"
      }
    ]
  },
  {
    "scene": "INT. HOTEL - LOBBY - DAY - M.L.S.",
    "description": " JACK leaning on reception desk with phone to ear.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "(into phone) Right it's a beautiful place.  You and Danny are gonna love it."
      }
    ]
  },
  {
    "scene": "INT. BOULDER APARTMENT/BATHROOM - DAY - M.S.",
    "description": " DANNY standing on stool by basin.  He is reflected in mirror. CAMERA TRACKS IN on his reflection in mirror. 14. DANNY wiggles forefinger. DANNY wiggles forefinger. DANNY wiggles forefinger.",
    "dialogue": [
      {
        "character": "DANNY",
        "line": "Tony, why don't you want to go to the hotel?"
      },
      {
        "character": "TONY (OFF)",
        "line": "I don't know."
      },
      {
        "character": "DANNY",
        "line": "You do too know, now come on tell me."
      },
      {
        "character": "TONY (OFF)",
        "line": "I don't want to."
      },
      {
        "character": "DANNY",
        "line": "Please..."
      },
      {
        "character": "TONY (OFF)",
        "line": "No."
      },
      {
        "character": "DANNY",
        "line": "Now Tony, tell me."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - LOBBY - M.L.S.",
    "description": " Shooting towards doors of lifts.  Blood gushes in from L.side of lift and in from corridors L. and R. of lift doors - surging towards camera.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL/CORRIDOR - M.S.",
    "description": " Two Little GRADY girls holding hands.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL/LOBBY - M.L.S.",
    "description": " Blood gushing in from corridors L-R of lift doors and surging towards camera. 15.",
    "dialogue": []
  },
  {
    "scene": "INT. BOULDER APARTMENT - M.C.S.",
    "description": " DANNY screaming.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL/LOBBY - M.L.S.",
    "description": " Blood gushing in from corridors L-R of lift doors and surging forward.  The blood gushes up into camera lens causing black out.",
    "dialogue": [
      {
        "character": "DOCTOR (OFF)",
        "line": "Now hold your eyes still so that I can see."
      }
    ]
  },
  {
    "scene": "INT. BOULDER APARTMENT/DANNY'S BEDROOM - DAY - M.S.",
    "description": " DOCTOR bending over DANNY lying on top of his bed.  She is examining his eyes.  WENDY standing at foot of bed. DOCTOR straightens up.  She puts instrument away in case and closes it.  Then she sits on bed beside DANNY. 16. M.S. DOCTOR sitting on bed beside DANNY.  WENDY standing at foot of bed. M.S. DOCTOR sitting on bed beside DANNY.  WENDY standing at foot of bed. 17. 18. M.S. DOCTOR sitting on bed beside DANNY.  She pats his leg and stands up.  WENDY at foot of bed. DOCTOR puts case and stethoscope in her shoulder bag. WENDY & DOCTOR move R-L to open door.  DOCTOR goes into the corridor.",
    "dialogue": [
      {
        "character": "DOCTOR",
        "line": "That's good, now the other one. Good boy."
      },
      {
        "character": "DOCTOR",
        "line": "Now Danny, when you were brushing your teeth, do you remember if you smelled anything funny, or saw any bright flashing lights, or anything at all strange?"
      },
      {
        "character": "DANNY",
        "line": "No."
      },
      {
        "character": "DOCTOR (OFF)",
        "line": "Do you remember when you were brushing your teeth?"
      },
      {
        "character": "DANNY",
        "line": "Yes."
      },
      {
        "character": "DOCTOR",
        "line": "What's the next thing you remember after you were brushing your teeth?"
      },
      {
        "character": "DANNY",
        "line": "Mommy saying, 'Wake up, wake up, wake up Danny, wake up.'"
      },
      {
        "character": "DOCTOR",
        "line": "Now Danny, can you remember what you were doing just before you started brushing your teeth?"
      },
      {
        "character": "DANNY",
        "line": "Talking to Tony."
      },
      {
        "character": "DOCTOR",
        "line": "Is Tony one of your animals?"
      },
      {
        "character": "DANNY",
        "line": "No.  It's the little boy that lives in my mouth."
      },
      {
        "character": "WENDY",
        "line": "Tony is his imaginary friend."
      },
      {
        "character": "DOCTOR (OFF)",
        "line": "Oh,"
      },
      {
        "character": "DOCTOR (CONT'D)",
        "line": "if you were to open your mouth now, could I see Tony?"
      },
      {
        "character": "DANNY",
        "line": "No."
      },
      {
        "character": "DOCTOR",
        "line": "Why not?"
      },
      {
        "character": "DANNY",
        "line": "Because he hides."
      },
      {
        "character": "DOCTOR",
        "line": "Where does he go?"
      },
      {
        "character": "DANNY",
        "line": "To my stomach."
      },
      {
        "character": "DOCTOR",
        "line": "Does Tony ever tell you to do things?"
      },
      {
        "character": "DANNY",
        "line": "I don't want to talk about Tony anymore."
      },
      {
        "character": "DOCTOR",
        "line": "Okay.  That's fine.  All right Danny."
      },
      {
        "character": "DOCTOR",
        "line": "Now I'm going to ask you to do me a favor, and stay quietly in bed for the rest of the day.  Okay?"
      },
      {
        "character": "DANNY",
        "line": "Do I have to?"
      },
      {
        "character": "DOCTOR",
        "line": "Yes, I'd like you to."
      },
      {
        "character": "WENDY",
        "line": "We're just going to go into one of the other rooms for a few minutes and talk - then I'll come back and check on you, okay?"
      },
      {
        "character": "DANNY",
        "line": "Okay."
      },
      {
        "character": "DOCTOR",
        "line": "Goodbye."
      }
    ]
  },
  {
    "scene": "INT. CORRIDOR/LIVING ROOM - DAY - M.S.",
    "description": " DOCTOR standing in corridor.  WENDY moves out of DANNY's room and closes the door.  She turns to DOCTOR. 19. DOCTOR & WENDY walk forward along the corridor - CAMERA TRACKS BACK before them and PANS R-L with them to Living Room.  WENDY points to sofa. DOCTOR moves to sofa and sits down - WENDY sits in chair cam.R. M.S. DOCTOR over WENDY.  DOCTOR leans back on sofa. M.S. WENDY over DOCTOR. 20. M.S. WENDY takes cigarette out of packet. WENDY holds cigarette packet out towards DOCTOR. She puts packet down on table. She lights cigarette from lighter. 21. M.S. WENDY over DOCTOR. M.S. DOCTOR over WENDY. M.C.S. WENDY - she shakes her head. M.S. DOCTOR over WENDY. WENDY inhales. 22. Superimposed Title over: 23.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Shall we go into the living room?"
      },
      {
        "character": "DOCTOR",
        "line": "Yes."
      },
      {
        "character": "WENDY",
        "line": "Please..."
      },
      {
        "character": "DOCTOR",
        "line": "Thank you."
      },
      {
        "character": "DOCTOR",
        "line": "Mrs. Torrance, I don't think you have anything to worry about.  I'm quite sure there is nothing physically wrong with Danny."
      },
      {
        "character": "WENDY",
        "line": "Oh, yeah.  Oh, yeah, he seems absolutely fine now, but you should have seen him."
      },
      {
        "character": "DOCTOR",
        "line": "Oh I know.  Kids can scare you to death, but believe me these episodes are not at all uncommon, and they look much worse than they are."
      },
      {
        "character": "WENDY",
        "line": "But eh what was the matter with him?"
      },
      {
        "character": "DOCTOR",
        "line": "Mrs. Torrance, most of the time these episodes with kids are never explained.  They are brought on by emotional factors, and they rarely occur again."
      },
      {
        "character": "DOCTOR",
        "line": "They're more akin to auto-hypnosis, a kind of self induced trance.  If it re-occurs which I doubt"
      },
      {
        "character": "DOCTOR (OFF) (CONT'D)",
        "line": "you can always think about having some tests done."
      },
      {
        "character": "DOCTOR (OFF)",
        "line": "No thank you."
      },
      {
        "character": "WENDY",
        "line": "Oh, I'm...I'm sure you're right."
      },
      {
        "character": "DOCTOR",
        "line": "Have you been in Boulder long, Mrs. Torrance?"
      },
      {
        "character": "WENDY",
        "line": "Only about three months.  Eh we're from Vermont.  My husband was teaching school there."
      },
      {
        "character": "DOCTOR",
        "line": "Did the appearance of Danny's imaginary friend...?"
      },
      {
        "character": "WENDY",
        "line": "Tony."
      },
      {
        "character": "DOCTOR",
        "line": "Did Tony's first appearance happen to coincide with your arrival here?"
      },
      {
        "character": "WENDY",
        "line": "No, um let's see I guess Danny started talkin to Tony about the time we put him into nursery school."
      },
      {
        "character": "DOCTOR",
        "line": "Did he adjust well to school?"
      },
      {
        "character": "WENDY",
        "line": "No.  He didn't like it too much at first, and then he had an injury, so we kept him out for a while, and, yeah, I...I guess that's about the time when I first noticed that he was talking to Tony."
      },
      {
        "character": "DOCTOR",
        "line": "What sort of injury did he have?"
      },
      {
        "character": "WENDY",
        "line": "Ah he dislocated his shoulder."
      },
      {
        "character": "DOCTOR (OFF)",
        "line": "How did he manage to do that?"
      },
      {
        "character": "WENDY",
        "line": "Well it's just one of those things. You know... purely an accident, um. My husband had oh... been drinking, and he came home about three hours late, so he wasn't exactly in the greatest mood that night.  And well Danny had scattered some of his school papers all over the room... and my husband grabbed his arm, you know, and pulled him away from them. It's...it's just the sort of thing you do a hundred times with a child - you know, in a park or on the streets - but on this particular occasion my husband just... used too much strength and he injured Danny's arm."
      },
      {
        "character": "WENDY (OFF) (CONT'D)",
        "line": "Anyway, something good did come out of it all because he said:"
      },
      {
        "character": "WENDY (CONT'D)",
        "line": "\"Wendy, I'm never gonna touch another drop and if I do you can leave me\", and he didn't and he hasn't had any alcohol in eh five months."
      }
    ]
  },
  {
    "scene": "EXT. COLORADO MOUNTAINS - DAY - L.S.",
    "description": " High Angle Trees on side of Mountain - CAMERA TRACKS FORWARD over them to Jack's car moving away along road.",
    "dialogue": []
  },
  {
    "scene": "INT. JACK'S CAR - DAY - M.S.",
    "description": " WENDY sitting beside JACK as he drives along Mountain Road. DANNY, between them, is leaning on backs of their seats. WENDY yawns. 24.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Boy, we must be really high up. The air feels so different."
      },
      {
        "character": "JACK",
        "line": "Uh...huh."
      },
      {
        "character": "DANNY",
        "line": "Dad?"
      },
      {
        "character": "JACK",
        "line": "Yes?"
      },
      {
        "character": "DANNY",
        "line": "I'm hungry."
      },
      {
        "character": "JACK",
        "line": "Well you should have eaten your breakfast."
      },
      {
        "character": "WENDY",
        "line": "We'll get something as soon as we get to the hotel, okay?"
      },
      {
        "character": "DANNY",
        "line": "Okay, Mom."
      },
      {
        "character": "WENDY",
        "line": "Hey, wasn't it around here that the Donner party got snowbound?"
      },
      {
        "character": "JACK",
        "line": "I think that was farther west in the Sierras."
      },
      {
        "character": "DANNY",
        "line": "What was the Donner party?"
      },
      {
        "character": "JACK",
        "line": "There were a party of settlers in the covered wagon times.  They got snowbound one winter in the mountains.  They had to resort to cannabilism in order to stay alive."
      },
      {
        "character": "DANNY",
        "line": "You mean they ate each other up?"
      },
      {
        "character": "JACK",
        "line": "They had to, in order to survive."
      },
      {
        "character": "WENDY",
        "line": "Jack..."
      },
      {
        "character": "DANNY",
        "line": "Don't worry, Mom.  I know all about cannabilism, I saw it on T.V."
      },
      {
        "character": "JACK",
        "line": "See, it's okay.  He saw it all on the television."
      }
    ]
  },
  {
    "scene": "EXT. COLORADO MOUNTAINS - DAY - L.S.",
    "description": " High Angle JACK's car moving away along road on side of mountain - CAMERA TRACKS after it.",
    "dialogue": []
  },
  {
    "scene": "EXT. OVERLOOK HOTEL - DAY - L.S.",
    "description": " Cars parked in front of Hotel.",
    "dialogue": []
  },
  {
    "scene": "INT. OVERLOOK HOTEL/LOBBY - M.L.S.",
    "description": " Man cleaning floor.  CAMERA TRACKS L-R.  WATSON & ULLMAN walk forward from b.g. 25. Two Girls carrying luggage enter cam.R and walk away to b.g. ULLMAN & WATSON walk L-R to JACK sitting in chair. JACK stands up. JACK points to luggage. ULLMAN turns to WATSON. 26. WATSON walks out cam.L. ULLMAN laughs and they move out cam.L.",
    "dialogue": [
      {
        "character": "ULLMAN",
        "line": "What time does the plane leave?"
      },
      {
        "character": "WATSON",
        "line": "Eight thirty."
      },
      {
        "character": "ULLMAN",
        "line": "Well, that still gives up plenty of time to go over everything first."
      },
      {
        "character": "GIRLS",
        "line": "Goodbye Mr. Ullman."
      },
      {
        "character": "ULLMAN",
        "line": "Goodbye."
      },
      {
        "character": "ULLMAN",
        "line": "Good morning Jack.  I hope you haven't been waiting too long."
      },
      {
        "character": "JACK",
        "line": "No problem.  In fact we had time to grab a bite to eat."
      },
      {
        "character": "ULLMAN",
        "line": "Good.  Glad you made it before they shut down the kitchen.  Is your family having a look around?"
      },
      {
        "character": "JACK",
        "line": "No, my son's discovered the games room."
      },
      {
        "character": "ULLMAN",
        "line": "Oh... Has your luggage been brought in?"
      },
      {
        "character": "JACK",
        "line": "Right there."
      },
      {
        "character": "ULLMAN",
        "line": "Oh fine.  Well in view of all the ground that we to cover today, I suggest we go and have a quick look at your apartment and then get started straight away."
      },
      {
        "character": "ULLMAN",
        "line": "Bill, would you have the Torrances' things brought in their apartment."
      },
      {
        "character": "WATSON",
        "line": "Fine."
      },
      {
        "character": "JACK",
        "line": "I'd better collect my family first."
      },
      {
        "character": "ULLMAN",
        "line": "Oh..."
      }
    ]
  },
  {
    "scene": "INT. HOTEL/COLORADO LOUNGE - DAY - M.L.S.",
    "description": " ULLMAN, followed by WENDY, JACK & WATSON, moves out of lift cam.R.  They walk R-L across Lounge.  CAMERA TRACKS with them. ULLMAN laughs. They reach corner and turn, walking towards camera. 27.",
    "dialogue": [
      {
        "character": "ULLMAN",
        "line": "This is our Colorado Lounge."
      },
      {
        "character": "WENDY",
        "line": "Oh, it's beautiful. (to Jack) My God, this place is fantastic, isn't it hon?"
      },
      {
        "character": "JACK",
        "line": "Sure is."
      },
      {
        "character": "WENDY",
        "line": "God, I've never seen anything like this before.  Are all of these Indian designs authentic?"
      },
      {
        "character": "ULLMAN",
        "line": "Yes, I believe they are based mainly on Navajo and Apache motifs."
      },
      {
        "character": "WENDY",
        "line": "Oh well they're really gorgeous. As a matter of fact this is probably the most gorgeous hotel I've ever seen."
      },
      {
        "character": "ULLMAN",
        "line": "Oh this old place has had an illustrious past.  In its heyday it was one of the stopping places for the jet set,"
      },
      {
        "character": "ULLMAN (CONT'D)",
        "line": "even before anybody knew what a jet set was.  We've had four presidents who stayed here, lots of movie stars."
      },
      {
        "character": "WENDY",
        "line": "Royalty?"
      },
      {
        "character": "ULLMAN",
        "line": "All the best people."
      }
    ]
  },
  {
    "scene": "INT. HOTEL GAMES ROOM - DAY - M.C.S.",
    "description": " DANNY throwing darts - CAMERA TRACKS BACK & PANS L-R with him as he walks to the dartboard.  He climbs up on chair and pulls two darts out.  He looks cam.L.  CAMERA ZOOMS IN on him. M.S. Two GRADY girls, holding hands, standing near open door. M.S.  Two GRADY girls, holding hands.  They look at one another, then turn and exit out through open doorway.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL/CARETAKER'S APARTMENT CORRIDOR - DAY - M.S.",
    "description": " ULLMAN leads WENDY & JACK forward along corridor to Caretaker's Apartment. Two Girls carrying bags enter from cam.L. 28. ULLMAN waves to Girls and moves cam.R into JACK's apartment. WENDY & JACK follow him.",
    "dialogue": [
      {
        "character": "ULLMAN",
        "line": "This is the staff wing of the hotel. None of the other bedrooms are heated during the winter."
      },
      {
        "character": "WENDY",
        "line": "Oh!"
      },
      {
        "character": "GIRLS",
        "line": "Goodbye Mr. Ullman."
      },
      {
        "character": "ULLMAN",
        "line": "Goodbye girls."
      },
      {
        "character": "ULLMAN",
        "line": "And here are your quarters."
      }
    ]
  },
  {
    "scene": "INT. HOTEL/JACK'S APARTMENT - DAY - M.S.",
    "description": " ULLMAN, followed by WENDY and JACK, move up steps.  ULLMAN points to open door cam.R. JACK leans forward and looks in small bedroom cam.L.  He turns and looks cam.R. at ULLMAN. They move into apartment.  JACK & WENDY move away through living room into bedroom - CAMERA TRACKS FORWARD after them. JACK feels bed. JACK & WENDY move away and enter bathroom - CAMERA TRACKS after them. 29.",
    "dialogue": [
      {
        "character": "ULLMAN",
        "line": "Living Room, bedroom, bathroom, and a small bedroom for your son."
      },
      {
        "character": "JACK",
        "line": "Perfect for a child."
      },
      {
        "character": "WENDY",
        "line": "Yeah."
      },
      {
        "character": "ULLMAN",
        "line": "Yes."
      },
      {
        "character": "ULLMAN (OFF)",
        "line": "Well the place is very nicely self- contained, easy to keep."
      },
      {
        "character": "JACK",
        "line": "Cosy."
      },
      {
        "character": "ULLMAN (OFF)",
        "line": "Yes, very cosy for a family, and if you feel like spreading out you have the rest of the hotel to move around in."
      },
      {
        "character": "JACK",
        "line": "Well, it's very... homely."
      },
      {
        "character": "WENDY",
        "line": "Yeah."
      }
    ]
  },
  {
    "scene": "EXT. HOTEL/THE MAZE - DAY - L.S.",
    "description": " ULLMAN leading WENDY, JACK & WATSON R-L along outside of Maze.  CAMERA TRACKS & PANS with them. They walk from end of Maze towards Hotel in b.g. Laughter. M.L.S. ULLMAN leads WENDY, JACK & WATSON L-R along front of Hotel - CAMERA TRACKS with them. ULLMAN points to red Snowcat at entrance of garage. 30. They walk towards SNOWCAT.",
    "dialogue": [
      {
        "character": "ULLMAN",
        "line": "This is our famous hedge maze. It's quite an attraction around here.  The walls are thirteen feet high and the hedges are about as old as the hotel itself.  It's a lot of fun,"
      },
      {
        "character": "ULLMAN (CONT'D)",
        "line": "but I wouldn't go in there unless I had an hour to spare to find my way out."
      },
      {
        "character": "WENDY",
        "line": "When was the Overlook built?"
      },
      {
        "character": "ULLMAN",
        "line": "Ah... construction started in 1907. It was finished in 1909.  The site is supposed to be located on an Indian burial ground, and I believe they actually had to repel a few Indian attacks as they were building it."
      },
      {
        "character": "ULLMAN",
        "line": "That's our Snowcat.  Can you both drive a car?"
      },
      {
        "character": "JACK & WENDY",
        "line": "(together) Yes."
      },
      {
        "character": "ULLMAN",
        "line": "That's fine because basically the Snowcat operates very much like a car and it won't take you long to get the hang of it."
      }
    ]
  },
  {
    "scene": "INT. HOTEL BALLROOM/CORRIDOR - DAY - M.S.",
    "description": " ULLMAN, JACK, WATSON & WENDY walk forward along corridor - CAMERA TRACKS BACK before them. ULLMAN leads WENDY, JACK & WATSON L-R into Gold Ballroom - CAMERA TRACKS with them.  Men in b.g. cleaning Ballroom. ULLMAN leads them L-R across Ballroom to closed bar. 31. He points to shuttered bar. DICK HALLORAN walks forward from b.g. ULLMAN laughs. ULLMAN waves to HALLORAN/ JACK shakes hands with DICK. HALLORAN shakes hands with WENDY. 32. WENDY waves out cam.L.",
    "dialogue": [
      {
        "character": "ULLMAN",
        "line": "As a matter of fact we eh... brought a decorator in from Chicago just last year to refurbish this part of the hotel."
      },
      {
        "character": "WENDY",
        "line": "Oh well he sure did a beautiful job. Pink and gold are my favorite colors."
      },
      {
        "character": "ULLMAN",
        "line": "Oh...well this is our gold ballroom."
      },
      {
        "character": "WENDY",
        "line": "Oh, I'll say."
      },
      {
        "character": "ULLMAN",
        "line": "We can accommodate up to three hundred people here very comfortably."
      },
      {
        "character": "WENDY",
        "line": "Boy, I bet you we could really have a good party in this room, huh hon?"
      },
      {
        "character": "ULLMAN",
        "line": "I'm afraid you're not going to do too well here unless you've brought your own supplies.  We always remove all the booze from the premises when we shut down:"
      },
      {
        "character": "ULLMAN",
        "line": "that reduces the insurance that we normally have to carry."
      },
      {
        "character": "JACK",
        "line": "We don't drink."
      },
      {
        "character": "ULLMAN",
        "line": "Well then, you're in luck."
      },
      {
        "character": "ULLMAN",
        "line": "Oh Dick, come on over and say hello to Mr. and Mrs. Torrance."
      },
      {
        "character": "HALLORAN",
        "line": "Sure."
      },
      {
        "character": "ULLMAN",
        "line": "This is Dick Halloran, our Head Chef."
      },
      {
        "character": "JACK",
        "line": "Mr. Halloran, I'm Jack, and this is my wife, Winifred."
      },
      {
        "character": "HALLORAN",
        "line": "Glad to meet you, Jack."
      },
      {
        "character": "HALLORAN",
        "line": "Glad to meet you, Winifred."
      },
      {
        "character": "WENDY",
        "line": "Nice to meet you."
      },
      {
        "character": "ULLMAN",
        "line": "The Torrances are going to take care of the Overlook for us this winter."
      },
      {
        "character": "HALLORAN",
        "line": "Oh, that's just great.  How do you folks like our hotel so far?"
      },
      {
        "character": "WENDY",
        "line": "Oh it's just wonderful."
      },
      {
        "character": "WENDY",
        "line": "Hi Danny!"
      }
    ]
  },
  {
    "scene": "INT. HOTEL - BALLROOM - DAY - M.S.",
    "description": " SUSIE holding DANNY's hand.  They walk L-R across Ballroom. CAMERA TRACKS with them to JACK, HALLORAN, WATSON, WENDY & DANNY walks L-R from SUSIE to WENDY.  WENDY looks at SUSIE. SUSIE exits cam.L.  ULLMAN turns to HALLORAN. 33. HALLORAN walks away to b.g.  WENDY & DANNY follow him. ULLMAN, JACK & WATSON move out cam.L.",
    "dialogue": [
      {
        "character": "SUSIE",
        "line": "I found him outside looking for you."
      },
      {
        "character": "(OFF)",
        "line": "Danny, did you get tired"
      },
      {
        "character": "(IN SHOT)",
        "line": "of bombing the universe?"
      },
      {
        "character": "DANNY",
        "line": "Yeah."
      },
      {
        "character": "WENDY",
        "line": "Danny, come on over here."
      },
      {
        "character": "WENDY",
        "line": "Thanks."
      },
      {
        "character": "ULLMAN",
        "line": "Thank you, Susie."
      },
      {
        "character": "ULLMAN",
        "line": "Dick, if you're ready to do it now, I think it would be a good idea if you could show Mrs. Torrance the kitchen, while I continue on with Jack."
      },
      {
        "character": "HALLORAN",
        "line": "It will be a pleasure.  Right this way Mrs. Torrance."
      },
      {
        "character": "WENDY",
        "line": "Great.  See you later, hon."
      },
      {
        "character": "JACK",
        "line": "Bye darling."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - KITCHEN - DAY - M.S.",
    "description": " WENDY holding DANNY's hand walks forward into kitchen with HALLORAN.  CAMERA TRACKS BACK before them. HALLORAN laughs. 34. HALLORAN laughs. HALLORAN points to cam.L and leans to cam.L taking hold of door handle.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "Mrs. Torrance, your husband introduced you as Winifred.  Now are you a Winnie or a Freddie?"
      },
      {
        "character": "WENDY",
        "line": "I'm a Wendy."
      },
      {
        "character": "HALLORAN",
        "line": "Oh Wendy.  That's nice.  That's the prettiest."
      },
      {
        "character": "WENDY",
        "line": "God.  This is the kitchen, huh?"
      },
      {
        "character": "HALLORAN",
        "line": "Yeah, this is it.  How do you like it, Danny?  Is it big enough for you?"
      },
      {
        "character": "DANNY",
        "line": "Yeah, it's the biggest place I've ever seen."
      },
      {
        "character": "WENDY",
        "line": "Yeah.  This whole place is such an enormous maze, I feel I'll have to leave a trail of breadcrumbs every time I come in."
      },
      {
        "character": "HALLORAN",
        "line": "Don't let it get you down Mrs. Torrance - it's big but it still ain't nothing but a kitchen... a lot of the stuff you'll never have to touch."
      },
      {
        "character": "WENDY",
        "line": "I wouldn't know what to do with it if I did."
      },
      {
        "character": "HALLORAN",
        "line": "Well one thing for sure, you don't have to worry about food because you folks could eat up here a whole year and never have the same menu twice."
      },
      {
        "character": "HALLORAN",
        "line": "Now right here is our walk-in freezer."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - FREEZER - DAY - M.S.",
    "description": " HALLORAN opens door and steps into freezer.  WENDY & DANNY stand in doorway.  HALLORAN points to various items. 35. HALLORAN laughs. HALLORAN points to step by door.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "Now this is where we keep all of out meat.  You got fifteen rib roasts - thirty ten pound bags of hamburgers.  You got twelve- turkeys, two dozen pork roasts and twenty legs of lamb. (to Danny) Do you like lamb, Doc?"
      },
      {
        "character": "DANNY",
        "line": "No."
      },
      {
        "character": "HALLORAN",
        "line": "You don't?  Well what's your favorite food then?"
      },
      {
        "character": "DANNY",
        "line": "French Fries and Ketchup."
      },
      {
        "character": "HALLORAN",
        "line": "Well I think we can manage that too, Doc.  Come along now.  Watch your step."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - KITCHEN - DAY - M.S.",
    "description": " DANNY & WENDY, followed by HALLORAN, come out of Freezer. HALLORAN closes the door and turns to WENDY. HALLORAN, DANNY & WENDY walk forward - CAMERA TRACKS BACK with them. 36. They all stop walking. HALLORAN bends down to DANNY. HALLORAN laughs and turns away to door cam.L.  He opens door.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Mr. Halloran,"
      },
      {
        "character": "WENDY (CONT'D)",
        "line": "how did you know we called him 'Doc'?"
      },
      {
        "character": "HALLORAN",
        "line": "Beg pardon?"
      },
      {
        "character": "WENDY",
        "line": "Doc.  You called Danny 'Doc' twice just now."
      },
      {
        "character": "HALLORAN",
        "line": "I did?"
      },
      {
        "character": "WENDY",
        "line": "Yeah.  We call him Doc sometimes, you know, like in the Bugs Bunny cartoons.  But how did you know that?"
      },
      {
        "character": "HALLORAN",
        "line": "Well I guess I probably heard you call him that."
      },
      {
        "character": "WENDY",
        "line": "Well, it's possible, but I honestly don't remember calling him that since we've been with you."
      },
      {
        "character": "HALLORAN",
        "line": "Well anyway, he looks like a Doc, doesn't he?"
      },
      {
        "character": "HALLORAN",
        "line": "(clicks his tongue) Me ah - what's up, Doc?"
      },
      {
        "character": "HALLORAN",
        "line": "Now this is the storeroom."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - STOREROOM - DAY - M.S.",
    "description": " HALLORAN moves forward into Storeroom, followed by DANNY & WENDY.  Groceries stacked on shelves. HALLORAN & WENDY move L-R - CAMERA TRACKS with them past shelf in f.g. M.S. DANNY standing by cardboard boxes.  CAMERA TRACKS IN on him. 37. M.S. HALLORAN talks inaudibly to WENDY, back to camera. CAMERA TRACKS IN on HALLORAN. M.S. HALLORAN & WENDY move R-L to DANNY by open door. CAMERA TRACKS with them.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "In here, Mrs. Torrance, is where we keep all the dried goods and the canned goods.  We got canned fruits and vegetables; canned fish and meats; hot and cold cereals."
      },
      {
        "character": "HALLORAN",
        "line": "Post Toasties, Cornflakes, Sugar Puffs, Rice Krispies, Oatmeal, Wheatina and Cream of Wheat."
      },
      {
        "character": "HALLORAN (OFF)",
        "line": "We got a dozen jugs of black molasses, we got sixty boxes of dried milk, thirty twelve pound bags of sugar."
      },
      {
        "character": "HALLORAN",
        "line": "(thought transfer) How'd you like some ice cream, Doc?"
      },
      {
        "character": "HALLORAN (OFF)",
        "line": "sociables, finger rolls and seven kinds of what-have-you."
      },
      {
        "character": "HALLORAN",
        "line": "Now we got dried peaches, dried apricots, dried raisins and dried prunes."
      }
    ]
  },
  {
    "scene": "INT. HOTEL KITCHEN - DAY - M.S.",
    "description": " HALLORAN, followed by WENDY & DANNY move out of Storeroom cam.R.f.g. HALLORAN laughs as he closes Storeroom door.  JACK, ULLMAN & WATSON walk forward from b.g. 38. HALLORAN leans down to DANNY. HALLORAN laughs. HALLORAN straightens up and looks at JACK. HALLORAN takes hold of DANNY's hand as ULLMAN, JACK, WENDY & WATSON move away to b.g. 39. HALLORAN & DANNY move out cam.L.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "You know, Mrs. Torrance, you gotta keep regular, if you want to be happy."
      },
      {
        "character": "ULLMAN",
        "line": "Hi."
      },
      {
        "character": "WENDY",
        "line": "Hi."
      },
      {
        "character": "ULLMAN",
        "line": "How're you getting on?"
      },
      {
        "character": "HALLORAN & WENDY",
        "line": "Just fine."
      },
      {
        "character": "ULLMAN",
        "line": "Dick, can we borrow Mrs. Torrance for a few minutes?  We're on our way through to the basement - I promise we won't keep her very long."
      },
      {
        "character": "HALLORAN",
        "line": "No problem, Mr. Ullman.  I was just getting to the ice cream."
      },
      {
        "character": "HALLORAN",
        "line": "Do you like ice cream, Doc?"
      },
      {
        "character": "DANNY",
        "line": "Yeah."
      },
      {
        "character": "HALLORAN",
        "line": "I thought you did."
      },
      {
        "character": "HALLORAN",
        "line": "You folks don't mind if I give Danny some ice cream, while we're waiting for you?"
      },
      {
        "character": "JACK",
        "line": "Not at all."
      },
      {
        "character": "WENDY",
        "line": "No, we don't mind."
      },
      {
        "character": "HALLORAN",
        "line": "Good."
      },
      {
        "character": "WENDY",
        "line": "Sound good to you, Danny?"
      },
      {
        "character": "DANNY",
        "line": "Yeah."
      },
      {
        "character": "WENDY",
        "line": "Okay.  You behave yourself."
      },
      {
        "character": "HALLORAN",
        "line": "Now what kind of ice cream do you like Doc?"
      },
      {
        "character": "DANNY",
        "line": "Chocolate."
      },
      {
        "character": "HALLORAN",
        "line": "Chocolate it shall be.  Come on son."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - GREEN CORRIDOR - DAY - M.S.",
    "description": " ULLMAN, JACK & WENDY - followed by WATSON - move forward. CAMERA TRACKS BACK before them. They turn corner and walk away along corridor.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "It's amazing how much activity is going on today."
      },
      {
        "character": "ULLMAN",
        "line": "Yes, well the guests and some of the staff left yesterday, but the last day is always very hectic - everybody wants to be on their way as early as possible."
      },
      {
        "character": "ULLMAN",
        "line": "By five o'clock tonight, you'll never know anybody was ever here."
      },
      {
        "character": "WENDY",
        "line": "Just like a ghost ship, huh?"
      },
      {
        "character": "ULLMAN",
        "line": "Yes."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - KITCHEN - DAY - M.C.S.",
    "description": " HALLORAN looking down cam.R. M.C.S. DANNY over HALLORAN - DANNY looking at HALLORAN. 40. M.C.S. DANNY over HALLORAN.  DANNY looking at HALLORAN. M.S. HALLORAN & DANNY sitting at table. 41. 42. M.S. HALLORAN & DANNY sitting at table. M.C.S. DANNY over HALLORAN 43. M.C.S. DANNY over HALLORAN. M.C.S. DANNY over HALLORAN. M.S. Shooting across table onto HALLORAN & DANNY. 44. 45. Superimposition over:",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "Do you know how I knew your name was Doc?"
      },
      {
        "character": "HALLORAN",
        "line": "You know what I'm talking about, don't you?"
      },
      {
        "character": "HALLORAN",
        "line": "I can remember when I was a little boy, my grandmother and I could hold conversations entirely without ever opening our mouths.  She called it shining,"
      },
      {
        "character": "HALLORAN (OFF)(CONT'D)",
        "line": "and for a long time I thought it was just the two of us that had the shine to us."
      },
      {
        "character": "HALLORAN",
        "line": "Just like you probably thought you was the only one.  But there are other folks, though mostly they don't know it, or don't believe it."
      },
      {
        "character": "HALLORAN",
        "line": "How long have you been able to do it?"
      },
      {
        "character": "HALLORAN",
        "line": "Why don't you want to talk about it?"
      },
      {
        "character": "DANNY",
        "line": "I'm not supposed to."
      },
      {
        "character": "HALLORAN",
        "line": "Who says you ain't supposed to?"
      },
      {
        "character": "DANNY",
        "line": "Tony."
      },
      {
        "character": "HALLORAN",
        "line": "Who's Tony?"
      },
      {
        "character": "DANNY",
        "line": "Tony's the little boy who lives in my mouth."
      },
      {
        "character": "HALLORAN",
        "line": "Is Tony the one that tells you things?"
      },
      {
        "character": "DANNY",
        "line": "Yes."
      },
      {
        "character": "HALLORAN",
        "line": "How does he tell you things?"
      },
      {
        "character": "DANNY",
        "line": "It's like I go to sleep, and he shows me things but when I wake up, I can't remember everything."
      },
      {
        "character": "HALLORAN",
        "line": "Does your Mum and Dad know about Tony?"
      },
      {
        "character": "DANNY",
        "line": "Yes."
      },
      {
        "character": "HALLORAN",
        "line": "Do they know he tell you things?"
      },
      {
        "character": "HALLORAN",
        "line": "Has Tony ever told you anything about this place?  About the Overlook Hotel?"
      },
      {
        "character": "DANNY",
        "line": "I don't know."
      },
      {
        "character": "HALLORAN",
        "line": "Now think real hard, Doc.  Think."
      },
      {
        "character": "DANNY",
        "line": "Maybe he showed me something."
      },
      {
        "character": "HALLORAN",
        "line": "Try to think what it was."
      },
      {
        "character": "DANNY",
        "line": "Mr. Halloran, are you scared of this place?"
      },
      {
        "character": "HALLORAN",
        "line": "No, I'm scared of nothing here. It's just that you know some places are like people, some shine and some don't.  I guess you could say the Overlook Hotel here has something about it that's like shining."
      },
      {
        "character": "DANNY",
        "line": "Is there something bad here?"
      },
      {
        "character": "HALLORAN",
        "line": "Well, you know Doc, when something happens it can leave a trace of itself behind... say like is someone burns toast."
      },
      {
        "character": "HALLORAN (OFF)",
        "line": "Well, maybe things that happened... leave other kinds of traces behind."
      },
      {
        "character": "HALLORAN",
        "line": "Not things that anyone can notice, but things that people who shine can see.  Just like they can see things that haven't happened yet. Well, sometimes they can see things that happened a long time ago... I think a lot of things happened right here in this particular hotel - over the years, and not all of them was good."
      },
      {
        "character": "DANNY",
        "line": "What about Room 237?"
      },
      {
        "character": "HALLORAN",
        "line": "Room 237?"
      },
      {
        "character": "DANNY",
        "line": "You're scared of Room 237, ain'tcha?"
      },
      {
        "character": "HALLORAN",
        "line": "No I ain't."
      },
      {
        "character": "DANNY",
        "line": "Mr. Halloran, what is in Room 237?"
      },
      {
        "character": "HALLORAN",
        "line": "Nothing.  There ain't nothing in Room 237, but you ain't got no business going in there anyway, so stay out!  You understand, stay out!"
      }
    ]
  },
  {
    "scene": "EXT. OVERLOOK HOTEL - DAY - M.L.S.",
    "description": " Hotel.  Mountain in b.g.",
    "dialogue": []
  },
  {
    "scene": "INT. OVERLOOK HOTEL - LOBBY - DAY - M.S.",
    "description": " WENDY pushing trolley forward along corridor.  CAMERA TRACKS BACK with her.  She turns to cam.L and enters Lobby.  CAMERA TRACKS R-L with her across lobby.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - KITCHEN & LOUNGE - DAY - M.S.",
    "description": " DANNY sitting on tricycle.  He pedals out of Kitchen into Lounge, across it and back into Kitchen. 46. CAMERA TRACKS FORWARD after him.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - CORRIDOR TO TORRANCE'S APARTMENT - DAY - M.S.",
    "description": " WENDY enters cam.L pushing trolley.  She pushes it forward along corridor.  CAMERA PANS L-R with her to door of their Apartment.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - TORRANCE'S APARTMENT - DAY - M.C.S.",
    "description": " JACK asleep in bed, reflected in mirror.  CAMERA TRACKS BACK. WENDY enters cam.R carrying tray.  She walks forward. CAMERA TRACKS BACK with her.  She puts tray down on table. CAMERA TRACKS FORWARD to JACK & WENDY reflected in mirror. JACK sticks his tongue out.  WENDY picks up plate and glass of orange juice. WENDY walks forward to JACK and puts plate down cam.L.  She hands him glass of orange juice and he drinks it. 47. He puts empty glass down cam.L and picks up plate of eggs and bacon. WENDY sits down cam.R. JACK starts to eat bacon. WENDY laughs. M.C.S. JACK over WENDY. 48. WENDY laughs.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Good Morning, hon.  Your breakfast is ready."
      },
      {
        "character": "JACK",
        "line": "What time is it?"
      },
      {
        "character": "WENDY",
        "line": "It's about eleven thirty."
      },
      {
        "character": "JACK",
        "line": "Eleven thirty - Jesus!"
      },
      {
        "character": "WENDY",
        "line": "I guess we've been staying up too late."
      },
      {
        "character": "JACK",
        "line": "I know it."
      },
      {
        "character": "WENDY",
        "line": "I made 'em just the way you like 'em, sunny side up."
      },
      {
        "character": "JACK",
        "line": "Hmm, nice."
      },
      {
        "character": "WENDY",
        "line": "It's really pretty outside.  How about taking me for a walk after you've finished your breakfast?"
      },
      {
        "character": "JACK",
        "line": "Oh I suppose I oughta try to do some writing first."
      },
      {
        "character": "WENDY",
        "line": "Any ideas yet?"
      },
      {
        "character": "JACK",
        "line": "Lots of ideas.  No good ones."
      },
      {
        "character": "WENDY",
        "line": "Well, something'll come.  It's just a matter of settling back into the habit of writing every day."
      },
      {
        "character": "JACK",
        "line": "Yeah... that's all it is."
      },
      {
        "character": "WENDY",
        "line": "It's really nice up here, isn't it?"
      },
      {
        "character": "JACK",
        "line": "I love it.  I really do.  I've never been this happy, or comfortable anywhere."
      },
      {
        "character": "WENDY",
        "line": "Yeah.  It's amazing how fast you get used to such a big place.  I tell you, when we first came up here, I thought it was kinda scarey."
      },
      {
        "character": "JACK",
        "line": "I fell in love with it right away. When I came up here from my interview, it was as though I had been here before.  We...we all have moments of deja vu, but this was ridiculous.  It was almost as though I knew what was going to be around every corner.  Ooohhhhh..."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - LOUNGE - DAY - M.S.",
    "description": " Typewriter with sheet of paper in it.  CAMERA TRACKS BACK and TILTS UP onto JACK throwing ball against wall. M.S. JACK back to camera throwing ball against wall.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - MAZE - DAY - M.L.S.",
    "description": " WENDY running after DANNY from Hotel to Maze - CAMERA PANS L-R & TRACKS with them to entrance to Maze. DANNY & WENDY run into Maze.  CAMERA TRACKS L-R onto plan of Maze on board. 49.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "The loser has to keep American clean, how's that?"
      },
      {
        "character": "DANNY",
        "line": "All right."
      },
      {
        "character": "WENDY",
        "line": "And you're gonna lose.  And I'm gonna get you - you betta run fast! Look out - I'm coming in close. All right?"
      },
      {
        "character": "DANNY (OFF)",
        "line": "You'll have to keep America clean."
      }
    ]
  },
  {
    "scene": "INT. MAZE - DAY - M.S.",
    "description": " DANNY & WENDY walking forward in Maze - CAMERA TRACKS BACK before them. M.S. WENDY & DANNY backs to camera walking away through Maze - CAMERA TRACKS FORWARD after them. WENDY & DANNY turn at dead end and walk away along Maze. CAMERA TRACKS after them.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Okay Danny, you win.  Let's take the rest of this walking, huh?"
      },
      {
        "character": "DANNY",
        "line": "Okay...oh!"
      },
      {
        "character": "WENDY",
        "line": "Give me your hand.  Oh, isn't it beautiful."
      },
      {
        "character": "DANNY",
        "line": "Yeah."
      },
      {
        "character": "WENDY",
        "line": "Here's a dead end."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - LOBBY - DAY - M.L.S.",
    "description": " JACK back to camera bounces ball on floor and catches it. Then he throws it away to b.g.  He walks away to model of Maze on table by window.  CAMERA TRACKS FORWARD after him. He stops by model and leans on table. M.S. Shooting over model of Maze on table to JACK looking down at it. M.C.S. JACK looking down.",
    "dialogue": []
  },
  {
    "scene": "EXT. MAZE - DAY - L.S.",
    "description": " High Angle shooting down on Maze.  WENDY & DANNY move through it.  CAMERA TRACKS DOWN on Maze. 50. M.S. DANNY & WENDY walk forward through Maze - CAMERA TRACKS BACK before them. Superimposition over:",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Oh what a Maze.  Isn't it beautiful."
      },
      {
        "character": "DANNY",
        "line": "Yeah."
      },
      {
        "character": "WENDY",
        "line": "It's so pretty."
      },
      {
        "character": "DANNY",
        "line": "Yeah."
      },
      {
        "character": "WENDY",
        "line": "I didn't think it was going to be this big, did you?"
      },
      {
        "character": "DANNY",
        "line": "No."
      }
    ]
  },
  {
    "scene": "EXT. HOTEL - DUSK - M.L.S.",
    "description": " Hotel.  Mountain in b.g.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - KITCHEN - DUSK - M.C.S.",
    "description": " WENDY's hands taking lid of can.  CAMERA TRACKS BACK to table with portable T.V. Set on it.  The set is switched on. WENDY carries tin to bowl on table. 51. Picture on T.V. Set changes to MAN & WOMAN.",
    "dialogue": [
      {
        "character": "WOMAN ANNOUNCER (OFF)",
        "line": "Rutherford was serving a life sentence for his conviction in the 1968 shooting and the search continues in the mountains near Uray today for that missing Aspen woman,"
      },
      {
        "character": "WOMAN ANNOUNCER (CONT'D)",
        "line": "twenty-four year old Susan Robertson has been missing ten days.  She disappeared while on a hunting trip with her husband.  They have good weather right now, but they may have to call off the search if the predicted snowstorm moves in tomorrow."
      },
      {
        "character": "WOMAN ANNOUNCER",
        "line": "But it's so beautiful here in Denver today, it's hard to believe a snowstorm could be that close."
      },
      {
        "character": "MAN ANNOUNCER",
        "line": "I know.  I want to go outside and lie in the sun.  Yet to our north, to our west, it is snowing and cold, and it's moving"
      },
      {
        "character": "MAN ANNOUNCER (CONT'D)",
        "line": "right here towards Colorado, right now as we talk.  It's incredible."
      },
      {
        "character": "WOMAN ANNOUNCER",
        "line": "I know."
      }
    ]
  },
  {
    "scene": "INT. OVERLOOK HOTEL - CORRIDORS - M.S.",
    "description": " DANNY back to camera on tricycle pedals away along corridors - CAMERA TRACKS after him.  He looks at door cam.L and slows down, stopping. M.S. DANNY in f.g.  Number 237 on door in b.g. M.C.S. DANNY looking at number. M.S. DANNY in f.g.  Number 237 on door in b.g. 52. M.L.S. Corridor.  DANNY in f.g. gets off tricycle, and moves R-L to door of room 237.  He looks up at number - then reaches out to door handle and turns it.  Door doesn't open. He looks up at number. M.S. Two GRADY Girls holding hands. M.S. DANNY looking up at number on door.  He moves L-R to his tricycle.  CAMERA PANS with him.  He sits on tricycle and pedals fast away along corridor.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - LOUNGE - NIGHT - M.L.S.",
    "description": " Lounge.  JACK sitting back to camera typing at table. CAMERA TRACKS FORWARD onto him. M.C.S. JACK typing. M.L.S. JACK back to camera typing at table in f.g.  WENDY enters cam.R.b.g. and walks forward to JACK. WENDY stops cam.R of him.  JACK pulls page from typewriter. WENDY kisses him. M.S. JACK looking up cam.L at WENDY. 53. M.S. JACK looking up cam.L at WENDY. M.S. JACK looking up cam.L at WENDY. JACK hits his forehead with his hand. 54. He picks up sheet of paper and tears it up.  Then he throws the pieces down. JACK taps typewriter keys. 55. M.L.S. WENDY standing cam.R of JACK back to camera sitting at table.  She turns and walks away to b.g.  CAMERA TRACKS M.S. JACK starts to type. Black Frames. Superimposition over:",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Hi, hon.  How's it going?"
      },
      {
        "character": "JACK",
        "line": "Fine."
      },
      {
        "character": "WENDY",
        "line": "Get a lot written today?"
      },
      {
        "character": "JACK",
        "line": "Yes."
      },
      {
        "character": "WENDY",
        "line": "Hey, the weather forecast said it's going to snow tonight."
      },
      {
        "character": "JACK",
        "line": "What do you want me to do about it?"
      },
      {
        "character": "WENDY",
        "line": "Ah, come on hon.  Don't be so grouchy."
      },
      {
        "character": "JACK",
        "line": "I'm not being grouchy.  I just want to finish my work."
      },
      {
        "character": "WENDY",
        "line": "Okay.  I understand.  I'll come back later on with a couple of sandwiches for you and... maybe you'll let me read something then."
      },
      {
        "character": "JACK",
        "line": "Wendy, (clears throat) let me explain something to you. Whenever you come in here and interrupt me, you're breaking my concentration."
      },
      {
        "character": "JACK (CONT'D)",
        "line": "you're distracting me,"
      },
      {
        "character": "JACK (CONT'D)",
        "line": "and it will then take me time to get back to where I was, understand?"
      },
      {
        "character": "WENDY",
        "line": "Yes."
      },
      {
        "character": "JACK",
        "line": "Fine.  Now we're going to make a new rule.  Whenever I am in here and you hear me typing,"
      },
      {
        "character": "JACK (CONT'D)",
        "line": "or whether you don't hear me typing, whatever the fuck you hear me doing in here, when I am in here that means that I am working - that means don't come in.  Now do you think you can handle that?"
      },
      {
        "character": "WENDY",
        "line": "Yes."
      },
      {
        "character": "JACK",
        "line": "Fine.  Why don't you start right now and get the fuck out of here, hmm?"
      },
      {
        "character": "WENDY",
        "line": "Okay."
      }
    ]
  },
  {
    "scene": "EXT. HOTEL - DAY - M.L.S.",
    "description": " WENDY running R-L being chased by DANNY carrying snowballs. AD LIB SHOUTS & LAUGHTER.  CAMERA TRACKS R-L with them past Hotel in b.g.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "I know you've got some."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - LOUNGE - DAY - M.S.",
    "description": " JACK at window watching WENDY & DANNY playing in the snow. CAMERA TRACKS IN to M.C.S. Superimposition over:",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - DAY - M.L.S.",
    "description": " HOTEL in b.g.  Trees and snow in f.g. 56.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - LOUNGE - DAY - M.L.S.",
    "description": " High Angle JACK sitting at table in b.g. typing.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - LOBBY & OFFICE - DAY - M.S.",
    "description": " WENDY standing at switchboard with headset on her L.ear and putting plugs into switchboard. WENDY puts socket into various plugs. WENDY puts headset and plug down and turns away from switchboard.  She walks R-L to door. M.L.S. WENDY walks out of switchboard - round counter and moves forward R-L across Lobby.  CAMERA TRACKS BACK before her.  She moves R-L into Office.  CAMERA PANS with her.  She stops at radio set and switches it on.  She pulls microphone towards her.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Oh no!"
      },
      {
        "character": "WENDY",
        "line": "I knew it!"
      },
      {
        "character": "WENDY",
        "line": "(into mike) This is KDK 12 calling KDK 1."
      }
    ]
  },
  {
    "scene": "INT. RANGER'S OFFICE - M.L.S.",
    "description": " RANGER seated at radio cam.L.  MAN standing at filing cabinet cam.R.  GIRL seated at desk cam.R. 57.",
    "dialogue": [
      {
        "character": "WENDY (OFF)",
        "line": "(over radio) KDK 12 to KDK 1."
      },
      {
        "character": "RANGER",
        "line": "(into mike) This is KDK 1.  We're receiving you. Over."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - OFFICE - DAY - M.S.",
    "description": " WENDY picks up microphone.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "(into mike) Hi.  This is Wendy Torrance at the Overlook Hotel."
      }
    ]
  },
  {
    "scene": "INT. RANGER'S OFFICE - DAY - M.S.",
    "description": " RANGER seated at radio speaking into mike.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(into mike) Hi.  How are you folks getting on up there?  Over."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - OFFICE - DAY - M.S.",
    "description": " WENDY, holding mike, seated on cabinet with foot up on desk.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "(into mike) Oh we're just fine, but our telephones don't seem to be doing too well.  Are the lines down by any chance?  Over."
      }
    ]
  },
  {
    "scene": "INT. RANGER'S OFFICE - DAY - M.S.",
    "description": " RANGER seated at radio, speaking into mike. 58.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(into mike) Yes.  Quite a few of them are down, due to the storm.  Over."
      },
      {
        "character": "WENDY",
        "line": "(over radio) Any chance of them being repaired soon?  Over."
      },
      {
        "character": "RANGER",
        "line": "(into mike) Well, I wouldn't like to say.  Most winters they stay that way until spring.  Over."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - OFFICE - DAY - M.S.",
    "description": " WENDY, holding mike, seated on cabinet with foot up on desk.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "(into mike) Boy, this storm is really something, isn't it?  Over."
      }
    ]
  },
  {
    "scene": "INT. RANGER'S OFFICE - DAY - M.S.",
    "description": " RANGER sitting at radio - speaking into mike.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(into mike) Oh yes.  It's one of the worst we've had for years.  Is there anything else we can do for you, Mrs. Torrance?  Over."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - OFFICE - DAY - M.S.",
    "description": " WENDY holding mike seated on cabinet with foot up on desk.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "(into mike) I suppose not.  Over."
      }
    ]
  },
  {
    "scene": "INT. RANGER'S OFFICE - DAY - M.S.",
    "description": " RANGER seated at radio - speaking into mike.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(into mike) Well, if you folks have any problems up there just give us a call, and Mrs. Torrance."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - OFFICE - DAY - M.S.",
    "description": " WENDY holding mike - seated on cabinet with one foot up on desk. 59. WENDY puts down mike.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(over radio) I think it might be a good idea if you leave your radio on all the time now.  Over."
      },
      {
        "character": "WENDY",
        "line": "(into mike) Okay.  We'll do that.  It was real nice talking to you.  Bye.  Over and Out."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - GREEN CORRIDOR - M.L.S.",
    "description": " DANNY pedals away along corridor on his tricycle.  CAMERA TRACKS after him.  He exits cam.R at the end of corridor. CAMERA TRACKS FORWARD along empty corridor.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - CORRIDOR - M.S.",
    "description": " DANNY pedals away along corridor.  CAMERA TRACKS after him. He turns corner and stops as he sees the two GRADY Girls at the end. M.L.S. DANNY back to camera in f.g.  The two GRADY Girls at end of corridor. M.L.S. DANNY back to camera in f.g.  The two GRADY Girls at end of corridor. 60. M.S. The two GRADY Girls laying on floor covered with bloodstains.  Bloodstained axe on floor in f.g.  Walls covered with bloodstains. M.L.S. Two GRADY Girls, holding hands and standing at end of corridor. M.S. The two GRADY Girls lying on floor, covered with bloodstains.  Bloodstained axe on floor in f.g.  Wall covered with bloodstains. M.C.S. DANNY reacts. M.S. Two GRADY Girls holding hands and standing at end of corridor. M.S. The two GRADY Girls lying on floor covered with bloodstains.  Bloodstained axe on floor in f.g.  Wall covered with bloodstains. M.S. Two GRADY Girls holding hands standing at end of corridor. M.S. Two GRADY Girls lying on floor covered with bloodstains. Bloodstained axe on floor in f.g. 61. Wall covered with bloodstains. M.C.S. DANNY reacts.  He puts hands over his eyes.  Then he opens his fingers and looks through them. M.S. DANNY's P.O.V.  Empty corridor. M.C.S. DANNY looking through his open fingers.  He lowers his hands from his face. M.L.S. DANNY back to camera in f.g. in empty corridor. He raises up his R.hand and wiggles his forefinger as he speaks. Superimposition over:",
    "dialogue": [
      {
        "character": "GRADY GIRLS",
        "line": "Hullo, Danny."
      },
      {
        "character": "GRADY GIRLS (OFF)",
        "line": "Come and play with us."
      },
      {
        "character": "GRADY GIRLS",
        "line": "Come and play with us, Danny."
      },
      {
        "character": "GRADY GIRLS",
        "line": "For ever..."
      },
      {
        "character": "GRADY GIRLS",
        "line": "... and ever..."
      },
      {
        "character": "GRADY GIRLS",
        "line": "...and ever."
      },
      {
        "character": "DANNY",
        "line": "Tony, I'm scared."
      },
      {
        "character": "TONY",
        "line": "Remember what Mr. Halloran said. It's just like pictures in a book, Danny.  It isn't real."
      }
    ]
  },
  {
    "scene": "INT. OVERLOOK HOTEL - LOBBY - DAY - M.S.",
    "description": " Play on Television set, CAMERA TRACKS BACK from set to reveal WENDY, seated on sofa cam.L, watching set, DANNY seated on floor watching set also cam.R. 62. Play on Television continues inaudibly in b.g. 63. DANNY stands up and runs out cam.L.",
    "dialogue": [
      {
        "character": "DOROTHY",
        "line": "(on T.V.) Please let me give you some money."
      },
      {
        "character": "HERMIE",
        "line": "(on T.V.) Oh I wouldn't think of it."
      },
      {
        "character": "DOROTHY",
        "line": "(on T.V.) Well how can I repay you?"
      },
      {
        "character": "HERMIE",
        "line": "(on T.V.) It's okay, really."
      },
      {
        "character": "DOROTHY",
        "line": "(on T.V.) Well I'm going to have some coffee. Would you like some?"
      },
      {
        "character": "HERMIE",
        "line": "(on T.V.) Sure."
      },
      {
        "character": "DOROTHY",
        "line": "(on T.V.) Great.  Sit down.  Oh these marvellous doughnuts, help yourself. Coffee will be ready in a few minutes."
      },
      {
        "character": "DANNY",
        "line": "Mom?"
      },
      {
        "character": "WENDY",
        "line": "Yes?"
      },
      {
        "character": "DANNY",
        "line": "Can I go to my room and get my fire-engine?"
      },
      {
        "character": "WENDY",
        "line": "Not right now, Daddy's asleep."
      },
      {
        "character": "DANNY",
        "line": "I won't make any noise."
      },
      {
        "character": "WENDY",
        "line": "Come on, Doc.  He only went to bed a few hours ago.  Can't you wait till later?"
      },
      {
        "character": "DANNY",
        "line": "I won't make a sound, I promise. I'll tip-toe."
      },
      {
        "character": "WENDY",
        "line": "Well all right.  But really don't make a sound."
      },
      {
        "character": "DANNY",
        "line": "I won't, Mom."
      },
      {
        "character": "WENDY",
        "line": "Make sure you come right back, 'cause I'm going to make lunch soon. Okay?"
      },
      {
        "character": "DANNY (OFF)",
        "line": "Okay, Mom."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - JACK'S APARTMENT - DAY - M.C.S.",
    "description": " Door opens and DANNY appears.  He enters room - CAMERA TRACKS BACK with him as he walks forward up steps.  He looks to cam.R.  CAMERA PANS L-R to JACK sitting on edge of bed. JACK looks towards camera. M.L.S. JACK seated on bed cam.R.f.g.  DANNY standing at open door in b.g. JACK holds out his hand to DANNY, who walks forward. M.S. JACK sitting on bed.  DANNY enters cam.L.f.g. and stops cam.R of JACK.  JACK sits DANNY on his knee and puts his arms round him, kissing him. 64. M.S. JACK over DANNY seated on his knee. JACK shakes his head. JACK smiles and looks at DANNY. 65. M.S. DANNY over JACK. M.S. JACK over DANNY. Superimposition over: 66.",
    "dialogue": [
      {
        "character": "DANNY",
        "line": "Can I go to my room and get my fire-engine?"
      },
      {
        "character": "JACK",
        "line": "Come here for a minute, first."
      },
      {
        "character": "JACK",
        "line": "How's it going, Doc?"
      },
      {
        "character": "DANNY",
        "line": "Okay."
      },
      {
        "character": "JACK",
        "line": "Are you having a good time?"
      },
      {
        "character": "DANNY",
        "line": "Yes, Dad."
      },
      {
        "character": "JACK",
        "line": "Good.  I want you to have a good time."
      },
      {
        "character": "DANNY",
        "line": "I am, Dad.  Dad?"
      },
      {
        "character": "JACK",
        "line": "Yes."
      },
      {
        "character": "DANNY",
        "line": "Do you feel bad?"
      },
      {
        "character": "JACK",
        "line": "No.  I'm just a little tired."
      },
      {
        "character": "DANNY",
        "line": "Then why don't you go to sleep?"
      },
      {
        "character": "JACK",
        "line": "I can't.  I have too much to do."
      },
      {
        "character": "DANNY",
        "line": "Dad?"
      },
      {
        "character": "JACK",
        "line": "Yes?"
      },
      {
        "character": "DANNY",
        "line": "Do you like this hotel?"
      },
      {
        "character": "JACK",
        "line": "Yes I do.  I love it.  Don't you?"
      },
      {
        "character": "DANNY",
        "line": "I guess so."
      },
      {
        "character": "JACK",
        "line": "Good.  I want you to like it here. I wish we could stay here for ever, and ever... ever."
      },
      {
        "character": "DANNY",
        "line": "Dad?"
      },
      {
        "character": "JACK",
        "line": "What?"
      },
      {
        "character": "DANNY",
        "line": "You wouldn't ever hurt Mummy and me, would you?"
      },
      {
        "character": "JACK",
        "line": "What do you mean?"
      },
      {
        "character": "JACK",
        "line": "Did your mother ever say that to you - that I would hurt you?"
      },
      {
        "character": "DANNY",
        "line": "No, Dad."
      },
      {
        "character": "JACK",
        "line": "Are you sure?"
      },
      {
        "character": "DANNY",
        "line": "Yes, Dad."
      },
      {
        "character": "JACK",
        "line": "I love you, Danny.  I love you more than anything else in the whole world, and I'd never do anything to hurt you, never... You know that, don't you, huh?"
      },
      {
        "character": "DANNY",
        "line": "Yes, Dad."
      },
      {
        "character": "JACK",
        "line": "Good."
      }
    ]
  },
  {
    "scene": "EXT. HOTEL - L.S.",
    "description": " Shooting across snow to Hotel in b.g.  Three lit windows.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - CORRIDOR TO ROOM 237 - M.C.S.",
    "description": " High Angle - DANNY playing on floor with toy cars and trucks. CAMERA TRACKS UP & BACK - yellow ball rolls in from f.g. and stops by one of DANNY's trucks.  DANNY looks up. M.L.S. DANNY, back to camera, in f.g. looking away along empty corridor. M.S. DANNY kneeling on the floor by his toys.  He stands up. M.L.S. DANNY, back to camera, in f.g.  Empty corridor in b.g. M.S. DANNY walks forward along corridor - CAMERA TRACKS BACK with him. M.L.S. Empty corridor.  CAMERA TRACKS FORWARD to open door of Room 237. CAMERA TRACKS FORWARD into room. 67.",
    "dialogue": [
      {
        "character": "DANNY",
        "line": "Mom?"
      },
      {
        "character": "DANNY",
        "line": "Mom?"
      },
      {
        "character": "DANNY (OFF)",
        "line": "Mom, are you in there?"
      }
    ]
  },
  {
    "scene": "INT. HOTEL - BOILER ROOM - M.S.",
    "description": " WENDY, holding clipboard.  She looks at dials on boiler - then moves R-L to second boiler.  CAMERA PANS with her.  She looks at dials - then moves R-L to switchboard and presses two switches.  She reacts as she hears JACK off groaning in his sleep.  She puts down clipboard and moves L-R.  CAMERA PANS with her.  She starts to run away to entrance.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - LOUNGE - M.S.",
    "description": " JACK leaning forward in chair with head resting on table. He groans and cries out as he sleeps.  CAMERA TRACKS IN on them.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - CORRIDOR TO LOUNGE - M.S.",
    "description": " WENDY running away along corridor - CAMERA TRACKS after her. WENDY turns corner to entrance to Lounge. WENDY runs forward into Lounge and goes to JACK asleep at table.  CAMERA TRACKS FORWARD. She puts her hands on his arm and back.  JACK stirs and falls off chair onto floor. M.S. JACK groans as he lies on floor.  WENDY enters cam.R and takes hold of his arm, assisting up onto his knees.  He groans and gasps. She smoothes his hair with her hand. 68. M.S. JACK over WENDY. He puts his hand up to his eyes. M.S. JACK handed up to his eyes - and WENDY. He lowers his hand. WENDY puts hand under his arm and he starts to rise.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Jack..."
      },
      {
        "character": "WENDY",
        "line": "Jack... Jack..."
      },
      {
        "character": "WENDY",
        "line": "Jack, honey, what's wrong?"
      },
      {
        "character": "WENDY",
        "line": "What happened, honey?  Hon?  What's wrong?  Jack!"
      },
      {
        "character": "JACK",
        "line": "I had... I had the most terrible nightmare I ever had.  It's the most horrible dream I ever had."
      },
      {
        "character": "WENDY",
        "line": "It's okay.  It's okay, now.  Really."
      },
      {
        "character": "JACK",
        "line": "I dreamed that I... that I killed you and Danny."
      },
      {
        "character": "JACK",
        "line": "But I didn't just kill you, I cut you up into little pieces."
      },
      {
        "character": "JACK",
        "line": "Oh..."
      },
      {
        "character": "JACK",
        "line": "My God, I must be losing my mind!"
      },
      {
        "character": "WENDY",
        "line": "Every...everything is just going to be all right.  Come on.  Here let's get up off the floor."
      }
    ]
  },
  {
    "scene": "INT. OVERLOOK HOTEL - LOUNGE - M.L.S.",
    "description": " DANNY back to camera in f.g. walks into Lounge.  In b.g. WENDY helps JACK up into his chair.  INAUDIBLE DIALOGUE. WENDY turns to DANNY and throws up her arm.  CAMERA TRACKS FORWARD with DANNY. 69. WENDY bends down to JACK. WENDY moves R-L behind table and moves forward to DANNY in f.g. She crouches down before DANNY and turns him cam.L to face her, and the window.  He is sucking his thumb.  She sees mark on his neck and tilts his head over sideways. She pulls DANNY's thumb out of his mouth. She puts her arms round him. M.L.S. JACK, back to camera, leaning back in chair in f.g. WENDY kneeling with her arms round DANNY in b.g. M.C.S. JACK sitting in chair with his hand up to his head. M.L.S. JACK back to camera leaning back in chair in f.g. WENDY kneeling with her arms round DANNY in b.g.  She stands up and lifts DANNY up in her arms. M.S. WENDY holding DANNY in her arms. 70. He shakes his head. He shakes his head. M.S. WENDY with DANNY in her arms moves backwards. She turns and runs away to entrance in b.g. M.C.S. JACK.  He lowers his hand.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Danny!  Everything's okay... Just go play in your room for a while. Your Dad's just got a headache. Danny - mind what I say.  Go play in your room!"
      },
      {
        "character": "WENDY",
        "line": "Hon, let me just go and get him out of here.  I'll be right back."
      },
      {
        "character": "WENDY",
        "line": "Danny, why don't you mind me - huh? Danny."
      },
      {
        "character": "WENDY",
        "line": "Oh my God!  Danny what happened to your neck?  Danny..."
      },
      {
        "character": "WENDY (CONT'D)",
        "line": "what happened to your neck, huh?"
      },
      {
        "character": "WENDY",
        "line": "You did this to him, didn't you?"
      },
      {
        "character": "WENDY (OFF)",
        "line": "You son of a bitch!  You did this to him,"
      },
      {
        "character": "WENDY (OFF)(CONT'D)",
        "line": "didn't you?"
      },
      {
        "character": "WENDY",
        "line": "How could you?  How could you?"
      }
    ]
  },
  {
    "scene": "INT. HOTEL BALLROOM CORRIDOR - M.L.S.",
    "description": " JACK enters cam.L in b.g. and walks forward.  CAMERA TRACKS BACK before him.  He mutters and flings his arms about.  He stops and looks at notice on trestle - \"THE GOLD ROOM.\" JACK moves L-R into entrance of Ballroom.  He reaches out cam.L and switches on lights - then moves away to lit bar in b.g.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - BALLROOM - M.L.S.",
    "description": " JACK walks L-R across Ballroom - CAMERA TRACKS & PANS with him to bar. M.L.S. JACK leans over counter and looks down. 71. JACK sits down and puts his hands up to his face. M.S. JACK with his hands up to his face.  He lowers his hands and looks - he lowers hands to bar and smiles. JACK looks cam.R then back at camera. JACK laughs. M.S. LLOYD standing behind bar. LLOYD moves forward - CAMERA TRACKS BACK revealing JACK seated at bar. 72. LLOYD turns away to bottles of shelf. LLOYD turns with bottle and glass to counter. M.S. JACK sitting at bar.  LLOYD puts bottle and glass down on bar.  LLOYD puts ice in glass and fills it from bottle. JACK looks at his wallet then at LLOYD. JACK laughs. 73. M.C.S. JACK looks at his glass. He drinks and lowers his glass - then looks at LLOYD. M.S. JACK sitting at bar.  LLOYD behind bar. JACK taps on bar and LLOYD fills up his glass. JACK laughs. 74. M.S. JACK over LLOYD.  He points finger at LLOYD. JACK drinks - then swirls drink round in glass, putting glass down on counter. JACK laughs. He looks cam.L then cam.R -- throwing his hands out and sighing. 75. He raps on counter with hand. JACK gestures with his hands.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "(to himself) God, I'd give anything for a drink?"
      },
      {
        "character": "JACK",
        "line": "My goddam soul, just a glass of beer."
      },
      {
        "character": "JACK",
        "line": "Hi Lloyd."
      },
      {
        "character": "JACK",
        "line": "A little slow tonight, isn't it?"
      },
      {
        "character": "LLOYD",
        "line": "Yes, it is, Mr. Torrance."
      },
      {
        "character": "LLOYD",
        "line": "What'll it be?"
      },
      {
        "character": "JACK",
        "line": "Now I'm awfully glad you asked me that, Lloyd, because I just happen to have two twenties and two tens right here in my wallet.  I was afraid they were going to be there until next April.  So here's what: you slip me a bottle of Bourbon, a glass and some ice.  You can do that, can't you, Lloyd?  You're not to busy, are you?"
      },
      {
        "character": "LLOYD",
        "line": "No, sir.  I'm not busy at all."
      },
      {
        "character": "JACK (OFF)",
        "line": "Good man."
      },
      {
        "character": "JACK (OFF)",
        "line": "You set them up, and I'll knock them back, Lloyd, one by one."
      },
      {
        "character": "JACK",
        "line": "White man's burden, Lloyd my man. White man's burden."
      },
      {
        "character": "JACK",
        "line": "Say, Lloyd, it seems I'm temporarily light."
      },
      {
        "character": "JACK",
        "line": "How's my credit in this joint anyway?"
      },
      {
        "character": "LLOYD",
        "line": "Your credit's fine, Mr. Torrance."
      },
      {
        "character": "JACK",
        "line": "That's swell.  I like you, Lloyd. I always liked you.  You were always the best of them."
      },
      {
        "character": "JACK (CONT'D)",
        "line": "Best goddamned bartender from Timbuctoo to Portland Maine - Portland Oregon for that matter."
      },
      {
        "character": "LLOYD",
        "line": "Thank you for saying so."
      },
      {
        "character": "JACK",
        "line": "Here's to five miserable months on the wagon and all the irreparable harm that it's caused me."
      },
      {
        "character": "LLOYD",
        "line": "How are things going, Mr. Torrance?"
      },
      {
        "character": "JACK",
        "line": "Things could be better, Lloyd. Things could be a whole lot better."
      },
      {
        "character": "LLOYD",
        "line": "I hope it's nothing serious."
      },
      {
        "character": "JACK",
        "line": "No, nothing serious."
      },
      {
        "character": "JACK",
        "line": "Just a little problem with the... old sperm bank upstairs."
      },
      {
        "character": "JACK",
        "line": "Nothing that I can't handle though, Lloyd.  Thanks."
      },
      {
        "character": "LLOYD",
        "line": "Women!  Can't live with 'em.  Can't live without 'em!"
      },
      {
        "character": "JACK",
        "line": "Words of wisdom, Lloyd.  Words of wisdom."
      },
      {
        "character": "JACK",
        "line": "I haven't laid a hand on him. Goddam it, I didn't.  I wouldn't touch one hair of his goddam little head.  I love the little son-of-a- bitch."
      },
      {
        "character": "JACK",
        "line": "I'd do anything for him.  Any fucking thing for him."
      },
      {
        "character": "JACK (OFF)",
        "line": "That damn bitch."
      },
      {
        "character": "JACK",
        "line": "As long as I live she'll never let me forget what happened!"
      },
      {
        "character": "JACK",
        "line": "I did hurt him once, okay?  It was an accident, complete unintentional. It could have happened to anybody."
      },
      {
        "character": "JACK",
        "line": "And it was three goddam years ago. The little fucker had thrown all my papers all over the floor.  All I tried to do was to pull him up.  A momentary loss of muscular coordination.  I mean... A few extra foot pounds of energy, per second... per second."
      },
      {
        "character": "WENDY (OFF)",
        "line": "Jack..."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - BALLROOM CORRIDOR - M.L.S.",
    "description": " WENDY, sobbing, runs forward along corridor.  CAMERA TRACKS BACK with her and PANS L-R into Ballroom.  She runs away to JACK sitting at bat in b.g.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Oh Jack! (sobs) Thank God you're here."
      }
    ]
  },
  {
    "scene": "INT. HOTEL BALLROOM - M.S.",
    "description": " JACK sitting back to camera at bar.  WENDY enters cam.R. 76. M.S. WENDY over JACK.",
    "dialogue": [
      {
        "character": "(OFF)",
        "line": "Jack,"
      },
      {
        "character": "(IN SHOT)",
        "line": "Jack, there's someone else in the hotel with us.  There's a crazy woman in one of the rooms.  She tried to strangle Danny."
      },
      {
        "character": "JACK",
        "line": "Are you out of your fucking mind?"
      },
      {
        "character": "WENDY",
        "line": "No.  It's the truth, really.  I swear it.  Danny told me.  He went up into one of the bedrooms, the door was open, and he saw this crazy woman in the bath-tub.  She tried to strangle him."
      },
      {
        "character": "JACK",
        "line": "Which room was it?"
      }
    ]
  },
  {
    "scene": "INT. MIAMI APARTMENT - M.C.S.",
    "description": " Montage of shots on T.V. Set for program \"NEWSWATCH.\" CAMERA TRACKS BACK to reveal T.V. Set.  HALLORAN's bare feet and legs on bed in f.g.  Shot of GLEN RINKER on T.V. Set with superimposed title: '10 GLEN RINKER WPLG MIAMI' 77. M.C.S. HALLORAN - CAMERA TRACKS BACK to reveal him lying on bed, watching T.V. M.S. HALLORAN's feet and legs on beg in f.g.  GLEN RINKER on T.V. Set at foot of bed. M.S. HALLORAN lying on pillows.  CAMERA TRACKS IN to C.S. his face, as he reacts. 78. COMMENTATOR continues inaudibly in b.g.",
    "dialogue": [
      {
        "character": "DISC JOCKEY (OFF)",
        "line": "(on T.V.) From Channel 10 in Miami, this is Newswatch - with Glen Rinker and Bishop, and the award winning Newswatch team."
      },
      {
        "character": "GLEN RINKER",
        "line": "(on T.V.) Good evening.  I'm Glen Rinker Newswatch 10.  While Miami continues to swelter in a record winter heatwave bringing temperatures to the mid and upper nineties, the Central and Rocky Mountain States are buried in snow."
      },
      {
        "character": "GLEN RINKER (CONT'D)",
        "line": "In Colorado ten inches of snow has fallen in just a few hours tonight. Travel in the Rockies is almost impossible."
      },
      {
        "character": "GLEN RINKER (OFF)",
        "line": "(on T.V.) Airports are shut down stranding thousands of passengers.  Highways are blocked by snowdrifts.  Railroad tracks are frozen.  Officials in Colorado tell Newswatch at least three people have been killed by exposure to freezing winds.  The Governor of Colorado is expected tomorrow to declare a weather emergency.  The National Guard might be called out to clear streets and roads.  Weather forecasters predict more snow and heavy winds tonight and tomorrow, with temperatures dropping well below zero."
      },
      {
        "character": "GLEN RINKER",
        "line": "(on T.V.) Back here in South Florida, we've got just the opposite problem; the heat and humidity are supposed to climb."
      },
      {
        "character": "GLEN RINKER (OFF)",
        "line": "(on T.V.) Local beaches should be jammed. Our weather expert Walter Cronice will have the local forecast later on."
      }
    ]
  },
  {
    "scene": "INT. OVERLOOK HOTEL - CORRIDOR - M.S.",
    "description": " Open door of Room 237.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - DANNY'S BEDROOM - M.C.S.",
    "description": " DANNY, his head shaking.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - ROOM 237 - M.S.",
    "description": " Mantlepiece and fireplace.  CAMERA PANS R-L across room to open door.  Then TRACKS FORWARD through doorway to slightly open door of bathroom.  CAMERA STOPS TRACKING.  Door swings open to reveal YOUNG LADY seated in bath behind curtain. M.S. YOUNG LADY seated in bath behind curtain.  She draws curtain aside with hand. M.C.S. JACK - he smiles. M.S. YOUNG LADY stands up in bath. M.S. YOUNG LADY steps out of bath. M.C.S. JACK - he smiles. 79. M.S. YOUNG LADY walks forward from bath and stops in f.g. M.C.S. JACK - he moves forward. M.S. JACK moves forward to YOUNG LADY - she puts her arms round his neck.  He puts his arms round her and they kiss. M.C.S. JACK over YOUNG LADY as they kiss.  He opens his eyes and reacts.  He pulls back from YOUNG LADY - CAMERA PANS L-R onto mirror.  JACK & WOMAN reflected in it.  He sees that she is covered with scars.  He takes his arms away from her - she starts to laugh.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - DANNY'S BEDROOM - M.C.S.",
    "description": " DANNY - he is shaking his head.  WOMAN LAUGHING OFF.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - ROOM 237 - BATHROOM - M.S.",
    "description": " ELDERLY WOMAN lying in water in bath.  WOMAN LAUGHING OFF. M.S. JACK shaking his head as he backs out of bathroom. M.S. Naked ELDERLY WOMAN laughing as she walks forward with outstretched arms.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - DANNY'S BEDROOM - M.C.S.",
    "description": " DANNY shaking his head.  WOMAN LAUGHING OFF.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - ROOM 237 - M.S.",
    "description": " Naked ELDERLY WOMAN lying in water in bath.  WOMAN LAUGHING 80. M.S. JACK backs down steps into living room - WOMAN LAUGHING M.S. Naked ELDERLY WOMAN laughing, as she walks forward with outstretched arms.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - DANNY'S BEDROOM - C.S.",
    "description": " DANNY shaking his head.  WOMAN LAUGHING OFF.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - ROOM 237 - M.S.",
    "description": " Naked ELDERLY WOMAN lying in water in bath.  She starts to sit up.  WOMAN LAUGHING OFF.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - CORRIDOR - M.S.",
    "description": " JACK backs out of Room 237 into corridor.  He closes the door and locks it - then backs away along corridor.  He exits cam.L.  WOMAN LAUGHING OFF.",
    "dialogue": []
  },
  {
    "scene": "INT. MIAMI APARTMENT - NIGHT - M.S.",
    "description": " HALLORAN telephone up to ear.  He dials number, then picks up phone and walks R-L to window.  He turns and walks back L-R.  He puts phone down. He puts telephone down.",
    "dialogue": [
      {
        "character": "OPERATOR",
        "line": "(over phone) We are sorry your call cannot be completed as dialed.  If you need assistance, please call the operator."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - JACK'S APARTMENT - M.S.",
    "description": " WENDY moves R-L in b.g. sobbing.  KNOCK ON DOOR OFF.  She reacts and runs forward. 81. She moves R-L.  CAMERA PANS with her down steps to front door.  CAMERA TRACKS FORWARD after her. WENDY takes chain off door and opens it.  JACK enters apartment. JACK closes front door. JACK & WENDY walks forward and move up steps to DANNY's bedroom.  CAMERA TRACKS BACK before them. JACK moves R-L and looks into darkened bedroom. JACK closes bedroom door and turns to WENDY. 82. They move L-R into Living Room.  CAMERA PANS with them and TRACKS after them across room. WENDY & JACK move into their bedroom. WENDY sits on bed. JACK sits down on bed beside her. M.C.S. WENDY sobbing. M.C.S. JACK over WENDY. M.C.S. WENDY shakes her head. M.C.S. JACK over WENDY. 83.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Jack?"
      },
      {
        "character": "JACK (OFF)",
        "line": "Yes, it's me."
      },
      {
        "character": "WENDY",
        "line": "Oh, thank God!"
      },
      {
        "character": "WENDY",
        "line": "Did you find anything?"
      },
      {
        "character": "JACK",
        "line": "No, nothing at all."
      },
      {
        "character": "JACK",
        "line": "I didn't see one goddam thing."
      },
      {
        "character": "WENDY",
        "line": "You went into the room Danny said - to 237?"
      },
      {
        "character": "JACK",
        "line": "Yes, I did."
      },
      {
        "character": "WENDY",
        "line": "And you didn't see anything at all?"
      },
      {
        "character": "JACK",
        "line": "Absolutely nothing.  How is he?"
      },
      {
        "character": "WENDY",
        "line": "He's still asleep."
      },
      {
        "character": "JACK",
        "line": "Good."
      },
      {
        "character": "JACK",
        "line": "I'm sure he'll be himself again in the morning."
      },
      {
        "character": "WENDY",
        "line": "Well, are you sure it was the right room?  I mean, maybe Danny made a mistake?"
      },
      {
        "character": "JACK",
        "line": "He must have gone into that room - the door was open and the lights were on."
      },
      {
        "character": "WENDY",
        "line": "Oh, I just don't understand."
      },
      {
        "character": "WENDY",
        "line": "Well what about those bruises on his neck?"
      },
      {
        "character": "WENDY",
        "line": "Somebody did that to him."
      },
      {
        "character": "JACK",
        "line": "I think he did it to himself."
      },
      {
        "character": "WENDY",
        "line": "No!  No, that's not possible."
      },
      {
        "character": "JACK",
        "line": "Wendy, once you rule out his version of what happened, there is no other explanation - is there? It wouldn't be that different from the episode that he had before we came up here, would it?"
      }
    ]
  },
  {
    "scene": "INT. OVERLOOK HOTEL - DANNY'S BEDROOM - M.S.",
    "description": " DANNY lying awake on his bed.  CAMERA TRACKS IN on him. M.S. Low Angle Door with word \"MURDER\" written backwards across it. M.C.S. DANNY lying awake on his bed.  CAMERA TRACKS IN on him.",
    "dialogue": [
      {
        "character": "WENDY (OFF)",
        "line": "Jack, whatever the explanation is,"
      },
      {
        "character": "WENDY (OFF)",
        "line": "I think we have to get Danny out of here."
      }
    ]
  },
  {
    "scene": "INT. JACK'S APARTMENT - BEDROOM - M.C.S.",
    "description": " JACK over WENDY. 84.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Get him out of here?"
      },
      {
        "character": "WENDY",
        "line": "Yes."
      },
      {
        "character": "JACK",
        "line": "You mean just leave the hotel?"
      },
      {
        "character": "WENDY",
        "line": "Yes."
      }
    ]
  },
  {
    "scene": "INT. DANNY'S BEDROOM - M.C.S.",
    "description": " DANNY with his mouth wide open.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - LOBBY - M.S.",
    "description": " Blood gushing forward from lifts and surging up into camera lens.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - JACK'S APARTMENT - M.C.S.",
    "description": " JACK over WENDY. M.S. WENDY & JACK sitting on bed - JACK stands up and turns to her. He starts to move away. M.L.S. JACK walks forward from WENDY, sitting on bed.  He crosses living room and CAMERA PANS R-L with him to steps leading to front door.  He walks away down steps, opens front door and walks away along corridor. 85. M.S. WENDY sitting on bed, starts to cry.  She leans forward and buries her face in her hands.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "It is so fucking typical of you to create a problem like this when I finally have a chance to accomplish something.  When I'm really into my work.  I could really write my own ticket if I went back to Boulder now, couldn't I?"
      },
      {
        "character": "JACK",
        "line": "Shovellings out driveways, work in a car wash - any of that appeal to you?"
      },
      {
        "character": "WENDY",
        "line": "Jack..."
      },
      {
        "character": "JACK",
        "line": "Wendy, I have let you fuck up my life so far, but I'm not going to let you fuck this up!"
      }
    ]
  },
  {
    "scene": "INT. HOTEL - KITCHEN - M.L.S.",
    "description": " JACK moves forward in kitchen.  He sweeps coffee pot off table onto floor.  CAMERA TRACKS BACK before him.  He kicks coffee pots on floor, then sweeps rings off stove onto floor. He kicks rings as he leaves kitchen, moving into corridor. CAMERA TRACKS BACK before him.  He stops and looks ahead.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL CORRIDOR LEADING TO BALLROOM - M.L.S.",
    "description": " Empty corridor.  Balloons and streamers strewn about.",
    "dialogue": []
  },
  {
    "scene": "INT. MIAMI - HALLORAN'S APARTMENT - NIGHT - M.S.",
    "description": " HALLORAN standing, phone up to ear. He picks up phone and walks R-L to window.  CAMERA PANS with him. 86.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(over phone) Good evening.  Forest Service."
      },
      {
        "character": "HALLORAN",
        "line": "(into phone) Hallo.  My name's Dick Halloran. I'm the Head Chef up at the Overlook Hotel."
      },
      {
        "character": "RANGER",
        "line": "(over phone) Good evening, Mr. Halloran.  What can I do for you?"
      },
      {
        "character": "HALLORAN",
        "line": "(into phone) Sir, I've been trying to make an urgent phone call up there,"
      },
      {
        "character": "HALLORAN (CONT'D)",
        "line": "(into phone) but the operator said that the phone lines are down."
      }
    ]
  },
  {
    "scene": "INT. RANGER'S OFFICE - M.S.",
    "description": " RANGER sitting at radio with phone to ear.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(into phone) Yes, I'm afraid a lot of lines around here are down, due to the storm."
      }
    ]
  },
  {
    "scene": "INT. MIAMI - HALLORAN'S APARTMENT - M.S.",
    "description": " HALLORAN, phone to ear, at window. HALLORAN moves L-R.  CAMERA TRACKS with him.  He puts phone on table.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "(into phone) Well, look sir, I hate to put you to any trouble, but there's a family up there all by themselves with a young kid, and with this storm and everything."
      },
      {
        "character": "HALLORAN",
        "line": "(into phone) I'd sure appreciate it if you'd give them a call on your radio just to see if everything is okay."
      }
    ]
  },
  {
    "scene": "INT. RANGER'S OFFICE - M.S.",
    "description": " RANGER sitting at radio, phone to ear. 87. RANGER puts phone down.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(into phone) I'd be glad to do that, sir.  Oh why don't you call me back in about eh twenty minutes?"
      },
      {
        "character": "HALLORAN",
        "line": "(over phone) Thank you very much.  I'll do that."
      },
      {
        "character": "RANGER",
        "line": "(into phone) All right, sir."
      }
    ]
  },
  {
    "scene": "INT. HOTEL CORRIDOR & BALLROOM - M.L.S.",
    "description": " JACK walks forward along corridor to Ballroom.  He turns L-R into Ballroom - CAMERA TRACKS with him revealing crowded Ballroom.  MAITRE D standing at entrance. JACK moves L-R across crowded Ballroom - CAMERA TRACKS with him to LLOYD serving behind bar.  JACK sits at bar.  LLOYD moves to him. LLOYD puts dishes of olives and peanuts on bar before JACK. M.S. JACK over LLOYD. M.S. JACK over LLOYD 88. M.S. JACK over LLOYD JACK takes handful of peanuts and empties them into his mouth.  LLOYD puts ice into glass. M.C.S. LLOYD preparing drink. M.S. JACK over LLOYD.  LLOYD pouring drink.  JACK takes out his wallet, takes out note and holds it out to LLOYD.  LLOYD holds up his hand. JACK looks down at note and up to LLOYD. M.S. JACK over LLOYD.  JACK looks down at his note then up at LLOYD. 89. M.S. JACK over LLOYD.  JACK puts note back into his wallet. He puts wallet away. M.S. JACK over LLOYD.  JACK tucking wallet into his hip pocket. M.S. JACK over LLOYD.  JACK smiles and picks up his drinks. JACK turns away from bar. M.L.S. JACK moves away from bar.  He dances forward to center of room - CAMERA TRACKS after him.  WOMAN enters cam.R.f.g. and walks away.  WAITER (GRADY), carrying tray of drinks, walks forward from b.g.  He bumps into WOMAN. GRADY staggers forward, colliding with JACK and spilling drinks down front of JACK's jacket. 90. He puts down tray and takes advocaat glass from JACK. GRADY puts glass on tray. GRADY mops JACK's jacket with his serviette. GRADY bends down and picks up his tray. JACK & GRADY start to walk away to the Gentlemen's.  CAMERA TRACKS after them. JACK pats GRADY on his back. 91. JACK & GRADY enter Gentlemen's Toilet. JACK exits cam.R behind door.",
    "dialogue": [
      {
        "character": "MAITRE D",
        "line": "Good evening, Mr. Torrance."
      },
      {
        "character": "JACK",
        "line": "Good evening."
      },
      {
        "character": "JACK",
        "line": "Hi Lloyd.  I've been away.  Now I'm back."
      },
      {
        "character": "LLOYD",
        "line": "Good evening Mr. Torrance."
      },
      {
        "character": "LLOYD",
        "line": "It's good to see you."
      },
      {
        "character": "JACK",
        "line": "It's good to be back, Lloyd."
      },
      {
        "character": "LLOYD",
        "line": "What'll it be, sir?"
      },
      {
        "character": "JACK",
        "line": "Hair of the dog that big me."
      },
      {
        "character": "LLOYD",
        "line": "Bourbon on the rocks."
      },
      {
        "character": "JACK",
        "line": "That'll do her."
      },
      {
        "character": "LLOYD",
        "line": "No charge to you, Mr. Torrance."
      },
      {
        "character": "JACK",
        "line": "No charge?"
      },
      {
        "character": "LLOYD",
        "line": "Your money's no good here."
      },
      {
        "character": "LLOYD",
        "line": "Orders from the house."
      },
      {
        "character": "JACK",
        "line": "Orders from the house."
      },
      {
        "character": "LLOYD",
        "line": "Drink up, Mr. Torrance."
      },
      {
        "character": "JACK",
        "line": "I'm the kind of man likes to know who's buying their drinks, Lloyd."
      },
      {
        "character": "LLOYD",
        "line": "It's not a matter that concerns you, Mr. Torrance - at least not at this point."
      },
      {
        "character": "JACK",
        "line": "Anything you say, Lloyd.  Anything you say."
      },
      {
        "character": "GRADY",
        "line": "Oh!"
      },
      {
        "character": "GRADY",
        "line": "Oh dear, oh dear.  I'm so sorry, sir.  Oh!"
      },
      {
        "character": "GRADY",
        "line": "Oh dear oh dear... I've made an awful mess of your jacket, sir."
      },
      {
        "character": "JACK",
        "line": "Oh eh that's all right.  I've got plenty of jackets."
      },
      {
        "character": "GRADY",
        "line": "I'm afraid it's advocaat sir.  It tends to stain."
      },
      {
        "character": "JACK",
        "line": "Advocaat is it?"
      },
      {
        "character": "GRADY",
        "line": "Yes sir.  Look um... I think the best thing is to come along to the gentlemen's room, sir, and eh..."
      },
      {
        "character": "GRADY",
        "line": "we'll get some water to it, sir."
      },
      {
        "character": "JACK",
        "line": "Looks as though you might have got a spot of it on yourself there, Jeevesy old boy."
      },
      {
        "character": "GRADY",
        "line": "That doesn't matter, sir.  You're the important one."
      },
      {
        "character": "JACK",
        "line": "Awfully nice of you to say.  Of course I intend to change my jacket this evening before the fish and goose soiree."
      },
      {
        "character": "GRADY",
        "line": "Very wise, sir.  Very wise."
      },
      {
        "character": "JACK (OFF)",
        "line": "Here, I'll just, eh..."
      }
    ]
  },
  {
    "scene": "INT. MEN'S TOILET - M.L.S.",
    "description": " Men's toilet.  JACK moves in from cam.L.b.g.  He holds door open. GRADY enters cam.L. GRADY walks forward and puts his tray down on basins cam.R. JACK walks forward. GRADY soaks his serviette under tap.  JACK puts glass down cam.L and turns to GRADY cam.R. JACK laughs.  GRADY starts to sponge JACK with serviette. GRADY sponges JACK. 92. M.S. JACK over GRADY.  GRADY sponging JACK's jacket. GRADY sponges JACK's trousers. JACK clears his throat. GRADY turns cam.L to basins to rinse serviette under tap. He turns back to JACK and sponges his jacket. GRADY sponges JACK's trousers. GRADY sponges JACK's jacket sleeve. 93. JACK takes serviette away from GRADY and wipes his hand with it. JACK throws serviette into basin cam.L. M.L.S. GRADY over JACK. M.S. JACK over GRADY. M.C.S. JACK laughs. 94. M.C.S. JACK.  He shakes his head.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "hold this for you there, Jeevesy."
      },
      {
        "character": "GRADY",
        "line": "Thank you, sir.  Thank you."
      },
      {
        "character": "GRADY",
        "line": "Now let's see if we can improve this with a little water, sir."
      },
      {
        "character": "JACK",
        "line": "Right, I'll just set my bourbon and advocaat down right there."
      },
      {
        "character": "GRADY",
        "line": "Won't keep you a moment, sir."
      },
      {
        "character": "JACK",
        "line": "Fine."
      },
      {
        "character": "JACK",
        "line": "What do they call you around here, Jeevesy?"
      },
      {
        "character": "GRADY",
        "line": "Grady, sir.  Delbert Grady."
      },
      {
        "character": "JACK",
        "line": "Grady?"
      },
      {
        "character": "GRADY",
        "line": "Yes, sir."
      },
      {
        "character": "JACK",
        "line": "Delbert Grady."
      },
      {
        "character": "GRADY",
        "line": "That's right, sir."
      },
      {
        "character": "JACK",
        "line": "Eh, Mr. Grady..."
      },
      {
        "character": "JACK (CONT'D)",
        "line": "haven't I seen you somewhere before?"
      },
      {
        "character": "GRADY",
        "line": "Why no, sir.  I don't believe so."
      },
      {
        "character": "GRADY",
        "line": "Ah ha, it's coming off now, sir."
      },
      {
        "character": "JACK",
        "line": "Eh... Mr. Grady... weren't you once the caretaker here?"
      },
      {
        "character": "GRADY",
        "line": "Why no, sir.  I don't believe so."
      },
      {
        "character": "JACK",
        "line": "You er a married man, are you, Mr. Grady?"
      },
      {
        "character": "GRADY",
        "line": "Yes, sir.  I have a wife and eh two daughters, sir."
      },
      {
        "character": "JACK",
        "line": "And, er... where are they now?"
      },
      {
        "character": "GRADY",
        "line": "Oh, they're somewhere around.  I'm not quite sure at the moment, sir."
      },
      {
        "character": "JACK",
        "line": "Mr. Grady, you were the caretaker here.  I recognize you.  I saw your picture in the newspapers.  You eh... chopped your wife and daughters up into little bits, and eh... and you blew your brains out."
      },
      {
        "character": "GRADY",
        "line": "That's strange, sir.  I don't have any recollection of that at all. Mr. Grady, you were the caretaker here."
      },
      {
        "character": "GRADY",
        "line": "I'm sorry to differ with you, sir, but you are the caretaker.  You have always been the caretaker, I should know, sir.  I've always been here."
      },
      {
        "character": "GRADY",
        "line": "Did you know, Mr. Torrance, that your son... is attempting to bring an outside party into this situation? Did you know that?"
      },
      {
        "character": "JACK",
        "line": "No."
      },
      {
        "character": "GRADY",
        "line": "He is, Mr. Torrance."
      },
      {
        "character": "JACK",
        "line": "Who?"
      },
      {
        "character": "GRADY",
        "line": "A nigger."
      },
      {
        "character": "JACK",
        "line": "A nigger!"
      },
      {
        "character": "GRADY",
        "line": "A nigger cook."
      }
    ]
  },
  {
    "scene": "INT. MEN'S LAVATORY - M.C.S.",
    "description": " 95. JACK smiles. M.C.S. JACK.  He looks about. JACK looks about. 96. M.C.S. JACK smiles.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "How?"
      },
      {
        "character": "GRADY",
        "line": "Your son has a very great talent. I don't think you are aware how great it is, but he is attempting to use that very talent against your will."
      },
      {
        "character": "JACK",
        "line": "Well, he is a very willful boy."
      },
      {
        "character": "GRADY",
        "line": "Indeed, he is, Mr. Torrance.  A very willful boy.  A rather naughty boy, if I may be so bold, sir."
      },
      {
        "character": "JACK",
        "line": "It's his mother."
      },
      {
        "character": "JACK",
        "line": "She eh... interferes."
      },
      {
        "character": "GRADY",
        "line": "Perhaps they need a good talking to, if you don't mind my saying so. Perhaps a bit more."
      },
      {
        "character": "GRADY (OFF)",
        "line": "My girls, sir, they didn't care for the Overlook at first.  One of them actually stole a packet of matches"
      },
      {
        "character": "GRADY (CONT'D)",
        "line": "and tried to burn it down.  But I corrected them, sir.  And when my wife tried to prevent me from doing my duty I corrected her."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - JACK'S APARTMENT - M.S.",
    "description": " WENDY, crying and holding cigarette, walks R-L from Living Room into Bedroom.  CAMERA PANS with her. WENDY turns and walks L-R back into LIVING ROOM - CAMERA TRACKS IN and PANS with her. WENDY turns and walks R-L into Bedroom - CAMERA PANS with her. 97. WENDY reacts and turns to cam.R.  She runs away to DANNY's bedroom door in b.g.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "(to herself) We have the Snowcat.  If the weather breaks, we might just be able to get down the mountain in that."
      },
      {
        "character": "WENDY",
        "line": "(to herself) I could call the Forest Rangers first and then tell them that we're coming so that they could start searching for us, in case we didn't make it."
      },
      {
        "character": "WENDY",
        "line": "(to herself) If Jack won't come with us, we'll just have to tell him that we are going by ourselves.  That's all there is to it."
      },
      {
        "character": "DANNY (OFF)",
        "line": "Red Rum.  Red Rum."
      },
      {
        "character": "DANNY (OFF)",
        "line": "Red Rum.  Red Rum."
      }
    ]
  },
  {
    "scene": "INT. DANNY'S BEDROOM - M.S.",
    "description": " WENDY opens door and stands in doorway. WENDY moves R-L from door.  CAMERA PANS with her and TRACKS BACK to reveal DANNY sitting up in bed.  WENDY sits beside him. M.C.S. DANNY over WENDY 98. M.C.S. WENDY over DANNY M.C.S. DANNY over WENDY. M.C.S. WENDY over DANNY. M.C.S. DANNY over WENDY. M.C.S. WENDY over DANNY. She leans forward and puts her arm round him.  She strokes his hair.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Danny?"
      },
      {
        "character": "DANNY (OFF)",
        "line": "Red Rum.  Red Rum.  Red Rum."
      },
      {
        "character": "DANNY",
        "line": "Red Rum."
      },
      {
        "character": "WENDY",
        "line": "Danny... what's the matter, hon?"
      },
      {
        "character": "DANNY",
        "line": "Red Rum."
      },
      {
        "character": "WENDY",
        "line": "Are you having a bad dream?"
      },
      {
        "character": "WENDY",
        "line": "Danny?  Hon?"
      },
      {
        "character": "TONY",
        "line": "Danny's not here, Mrs. Torrance."
      },
      {
        "character": "WENDY",
        "line": "Come on, hon, wake up.  You just had a bad dream.  Everything's okay."
      },
      {
        "character": "TONY",
        "line": "Danny can't wake up, Mrs. Torrance."
      },
      {
        "character": "WENDY",
        "line": "Danny, wake up!  Come on, right now,"
      },
      {
        "character": "WENDY",
        "line": "Wake up."
      },
      {
        "character": "TONY",
        "line": "Danny's gone away, Mrs. Torrance."
      },
      {
        "character": "WENDY",
        "line": "Danny..."
      }
    ]
  },
  {
    "scene": "INT. HOTEL LOBBY - M.L.S.",
    "description": " JACK walking L-R past reception desk.  CAMERA TRACKS with him to office.  He goes in and switches on lights. 99.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(over radio) This is KDK 1 calling KDK 12.  KDK 1 calling KDK 12.  Are you receiving me?  This is KDK 1 calling KDK 12. KDK 1 calling KDK 12.  Do you read me?"
      }
    ]
  },
  {
    "scene": "INT. HOTEL - OFFICE - M.L.S.",
    "description": " JACK walks from office into inner office.  CAMERA TRACKS after him.  He stops by radio set. M.S. JACK looking down at radio set.  He tries to take the cover off. JACK unscrews back of set and lifts cover off radio.  He drops it on floor. He reaches out to the set with his hand. M.C.S. JACK's hand touches component in set.  He pulls it out. He pulls two more components out of set.  He rattles them in his hand, then moves out cam.L. 100.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(over radio) This is KDK 1 calling KDK 12.  KDK 1  calling KDK 12.  Are you receiving me?"
      },
      {
        "character": "RANGER",
        "line": "(over radio) KDK 1 calling KDK 12.  KDK 1 calling KDK 12.  Do you read me?"
      },
      {
        "character": "RANGER",
        "line": "(over radio) This is KDK 1 calling KDK 12.  KDK 1 calling KDK 12."
      },
      {
        "character": "RANGER",
        "line": "(over radio) Are you recei..."
      }
    ]
  },
  {
    "scene": "INT. MIAMI - HALLORAN'S APARTMENT - NIGHT - M.S.",
    "description": " HALLORAN, phone to ear, walks R-L towards window.  CAMERA PANS with him.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(over phone) Good evening.  Forest Service."
      },
      {
        "character": "HALLORAN",
        "line": "(into phone) Hallo, this is Dick Halloran again. I called a while ago about the folks at the Overlook Hotel."
      }
    ]
  },
  {
    "scene": "INT. RANGER'S OFFICE - NIGHT - M.S.",
    "description": " RANGER sitting at radio, phone to ear. MAN enters from cam.R.f.g. and walks away to b.g.",
    "dialogue": [
      {
        "character": "RANGER",
        "line": "(into phone) Oh yeah.  We tried to contract them several times by radio, but they didn't answer."
      },
      {
        "character": "RANGER",
        "line": "(into phone) Now, maybe they've got their radio turned off or they're in a place where they can't hear it.  If you like me to, I'd be glad to try them again later on."
      }
    ]
  },
  {
    "scene": "INT. MIAMI - HALLORAN'S APARTMENT - NIGHT - M.S.",
    "description": " HALLORAN, phone to ear. He walks L-R.  CAMERA TRACKS & PANS with him.  He puts phone down on receiver, and puts his hand up to his head. 101. Superimposition: 8 a.m.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "(into phone) Oh, that's very nice of you.  I'll call you back later.  Bye."
      }
    ]
  },
  {
    "scene": "EXT. SKY - DAY - L.S.",
    "description": " D.C.10 in flight.",
    "dialogue": []
  },
  {
    "scene": "INT. D.C.10 - M.C.S.",
    "description": " HALLORAN sitting in seat.  CAMERA TRACKS BACK to reveal other passengers in their seats.  HALLORAN turns in his seat and looks cam.L.  STEWARDESS enters from cam.L and stops beside HALLORAN. STEWARDESS walks out cam.R.  HALLORAN looks at his wristwatch.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "Pardon me, miss.  What time will we get to Denver?"
      },
      {
        "character": "STEWARDESS",
        "line": "We're due to arrive at 8:20, sir."
      },
      {
        "character": "HALLORAN",
        "line": "Thank you very much."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - LOUNGE - L.S.",
    "description": " Shooting through entrance onto JACK seated, back to camera, typing at table in b.g.  CAMERA TRACKS FORWARD onto JACK.",
    "dialogue": []
  },
  {
    "scene": "EXT. AIRPORT - DAY - L.S.",
    "description": " D.C.10 moves away along flare path, as it lands.",
    "dialogue": []
  },
  {
    "scene": "EXT. DURKIN'S GARAGE - M.L.S.",
    "description": " DURKIN at car by petrol pump.  He moves away R-L to office. 102.",
    "dialogue": []
  },
  {
    "scene": "INT. DURKIN'S GARAGE - M.S.",
    "description": " MAN standing cam.L.  MAN sitting reading magazine.  DURKIN enters.  He stamps snow off his feet and moves L-R.  CAMERA PANS with him behind counter.  He picks up ringing phone.",
    "dialogue": [
      {
        "character": "DURKIN",
        "line": "(into phone) Durkin's garage."
      },
      {
        "character": "HALLORAN",
        "line": "(over phone) Hello, can I speak to Larry?"
      },
      {
        "character": "DURKIN",
        "line": "(into phone) Speaking."
      }
    ]
  },
  {
    "scene": "INT. AIRPORT - M.S.",
    "description": " HALLORAN at telephone booth, phone to ear.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "(into phone) Hello Larry.  This is Dick, Dick Halloran."
      }
    ]
  },
  {
    "scene": "INT. DURKIN'S GARAGE - M.S.",
    "description": " DURKIN, phone to ear, behind counter.",
    "dialogue": [
      {
        "character": "DURKIN",
        "line": "(into phone) Dick, how are you doing?  How's the weather down there?"
      }
    ]
  },
  {
    "scene": "INT. AIRPORT - M.S.",
    "description": " HALLORAN, phone to ear. 103.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "(into phone) I'm not in Florida, Larry.  I'm calling from Stapleton Airport."
      }
    ]
  },
  {
    "scene": "INT. DURKIN'S GARAGE - M.S.",
    "description": " DURKIN, phone to ear, leaning on counter.",
    "dialogue": [
      {
        "character": "DURKIN",
        "line": "(into phone) What the hell are you doing down there?"
      }
    ]
  },
  {
    "scene": "INT. AIRPORT - M.S.",
    "description": " HALLORAN, phone to ear.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "(into phone) Well, I just got in from Miami, and I've got to get up to the Overlook today.  What's the weather like up there?"
      }
    ]
  },
  {
    "scene": "INT. DURKIN'S GARAGE - M.S.",
    "description": " DURKIN, phone to ear.",
    "dialogue": [
      {
        "character": "DURKIN",
        "line": "(into phone) Well, the snow ploughs are keeping things moving in town, but the mountain roads are completely blocked."
      }
    ]
  },
  {
    "scene": "INT. AIRPORT - M.S.",
    "description": " HALLORAN, phone to ear.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "(into phone) That means I'm going to need a snowcat to get up there, Larry. Can you fix me up with one?"
      }
    ]
  },
  {
    "scene": "INT. DURKIN'S GARAGE - M.S.",
    "description": " DURKIN, phone to ear. 104.",
    "dialogue": [
      {
        "character": "DURKIN",
        "line": "(into phone) What's the big deal about getting up there today, especially in this kind of weather?"
      }
    ]
  },
  {
    "scene": "INT. AIRPORT - M.S.",
    "description": " HALLORAN, phone to ear.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "(into phone) Larry, just between you and me, we've got a very serious problem with the people who are taking care of the place.  They've turned out to be completely unreliable assholes. Ullman phoned me last night, and I'm supposed to go up there and find out if they have to be replaced."
      }
    ]
  },
  {
    "scene": "INT. DURKIN'S GARAGE - M.S.",
    "description": " DURKIN, phone to ear, looks at his watch.",
    "dialogue": [
      {
        "character": "DURKIN",
        "line": "(into phone) How long is it going to take you to get up here?"
      }
    ]
  },
  {
    "scene": "INT. AIRPORT - M.S.",
    "description": " HALLORAN phone to ear.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "(into phone) Oh about five hours.  I'm gonna rent a car here at the airport."
      }
    ]
  },
  {
    "scene": "INT. DURKIN'S GARAGE - M.S.",
    "description": " DURKIN, phone to ear. 105.",
    "dialogue": [
      {
        "character": "DURKIN",
        "line": "(into phone) Okay, Dick - I'll take care of it."
      }
    ]
  },
  {
    "scene": "INT. AIRPORT - M.S.",
    "description": " HALLORAN phone to ear.",
    "dialogue": [
      {
        "character": "HALLORAN",
        "line": "(into phone) Oh thanks a lot, Larry.  I really appreciate that."
      }
    ]
  },
  {
    "scene": "INT. DURKIN'S GARAGE - M.S.",
    "description": " DURKIN phone to ear. He puts phone down.",
    "dialogue": [
      {
        "character": "DURKIN",
        "line": "(into phone) That's all right.  Drive carefully."
      }
    ]
  },
  {
    "scene": "EXT. ROAD - NIGHT - M.L.S.",
    "description": " HALLORAN's car moving forward along snow covered road. CAMERA TRACKS BACK with it.",
    "dialogue": [
      {
        "character": "VOICE OVER RADIO",
        "line": "Well, good morning to you, Hal and Charlie on Radio 63, KHOW Denver"
      }
    ]
  },
  {
    "scene": "INT. HALLORAN'S CAR - NIGHT - M.C.S.",
    "description": " HALLORAN sitting behind wheel as he drives along road L-R. 106. M.S. Shooting from behind HALLORAN through windscreen as he drives along road, passing overturned truck cam.L.",
    "dialogue": [
      {
        "character": "VOICE OVER RADIO (CONT'D)",
        "line": "and, Charlie, we have what you call your bad day out there.  What you call your heavy snow, snowing hard throughout the eh Denver metro area. Many of the mountain passes - Wolf Creek, and Red Mountain passes are already closed..."
      },
      {
        "character": "VOICE OVER RADIO (CONT'D)",
        "line": "and the chain law is in effect right now at the Eisenhower Tunnel. I guess as we've just heard from the news forecast, Charlie, a few of the flights are still landing out at Stapleton International Airport, and, with these early storms like this, I guess the entire airport will probably be closed within the hour.  Yeah, they're just not prepared.  The storm will continue throughout the day, and the national weather service... has declared a stopmans and travelers advisory... for all areas outlying the Denver metro region - get the cows in the barn. There you go.  Many businesses..."
      }
    ]
  },
  {
    "scene": "INT. OVERLOOK HOTEL - JACK'S APARTMENT - M.S.",
    "description": " DANNY & WENDY sitting at table watching T.V. Set cam.L. WENDY inhales cigarette and looks at her watch.  She puts cigarette out cam.R. WENDY strokes his hair, then takes hold of his chin and turns his face to her. She lowers her hand from his chin and strokes his hair. She strokes his hair. 107. DANNY holds up his forefinger and wiggles it. WENDY kisses DANNY's head. She kisses his head and strokes his hair - then stands up and walks away to door.  She stops and picks up a baseball bat from cam.R.  She walks away through open doorway, and exits cam.R.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Hon,"
      },
      {
        "character": "WENDY (CONT'D)",
        "line": "...listen to me for a minute, will you, hon?"
      },
      {
        "character": "WENDY",
        "line": "I'm just going to go and talk to Daddy for a few minutes and I'll be right back.  I want you to just stay here and watch your cartoons, okay?"
      },
      {
        "character": "WENDY",
        "line": "Okay, hon?"
      },
      {
        "character": "TONY",
        "line": "Yes, Mrs. Torrance."
      },
      {
        "character": "WENDY",
        "line": "All right.  Now I'll be back in just about five minutes.  I'm gonna lock the door behind me."
      }
    ]
  },
  {
    "scene": "INT. HOTEL LOUNGE - M.L.S.",
    "description": " WENDY, carrying baseball bat, walks away into Lounge.  As she goes, she turns and looks about her - CAMERA TRACKS after her. She looks about and then moves L-R past table, with his typewriter on it.  She walks L-R behind pillar and appears again on the other side.  CAMERA TRACKS with her. WENDY stops and looks about. M.L.S. WENDY, holding bat, in f.g.  She turns and walks away to JACK's typewriter on table in b.g. M.S. Low Angle - JACK's typewriter in f.g.  WENDY moves forward into shot.  She looks down at sheet of paper in typewriter. M.C.S. Sheet of paper in typewriter with repetition of line on it, reading: \"ALL WORK AND NO PLAY MAKES JACK A DULL BOY.\" 108. Sheet of paper is turned up, showing repetition of line. Again sheet of paper is turned up showing repetition of line. M.S. Low Angle - WENDY looking down at sheet of paper in typewriter.  She looks cam.R - then moves to cam.R. M.S. Sheets of paper, filling cardboard box.  CAMERA TRACKS IN on top sheet, showing repetition of the line \"ALL WORK AND NO PLAY MAKES JACK A DULL BOY.\" filling sheet. M.S. Low Angle WENDY looking down at box of paper in f.g. She holds up top sheet and looks at it - then puts it down in box. M.C.S. Sheets of paper filling box.  WENDY's hand enters cam.L.f.g.  She flicks through sheets of paper and sees they are all filled with repetition of line: \"ALL WORK AND NO PLAY MAKES JACK A DULL BOY.\" M.S. Low Angle - WENDY flicking through sheets of paper in box. M.S. Pillar.  CAMERA TRACKS R-L revealing WENDY, back to camera, looking through sheets of paper in box on table in M.L.S.  JACK enters cam.R.f.g. WENDY SCREAMS and turns round to face JACK. JACK moves away towards table.  WENDY walks R-L along table. M.S. JACK moves forward.  CAMERA TRACKS BACK before him. 109. He stops by chair and puts his hand on back of it. M.S. WENDY holding bat. M.S. JACK - hand on back of chair. JACK moves R-L to table.  CAMERA TRACKS BACK. JACK flicks through sheets of paper in box - then looks towards WENDY. M.S. WENDY holding bat. JACK moves forward L-R.  CAMERA PANS with him. 110. M.S. WENDY, holding bat, moves L-R.  CAMERA PANS with her.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Jack...?"
      },
      {
        "character": "WENDY",
        "line": "Jack...?"
      },
      {
        "character": "JACK",
        "line": "How do you like it?"
      },
      {
        "character": "WENDY",
        "line": "Jack!"
      },
      {
        "character": "JACK",
        "line": "How do you like it?"
      },
      {
        "character": "JACK",
        "line": "What are you doing down here?"
      },
      {
        "character": "WENDY",
        "line": "I just eh... wanted..."
      },
      {
        "character": "WENDY (OFF)",
        "line": "...to talk to you."
      },
      {
        "character": "JACK",
        "line": "Okay.  Let's talk."
      },
      {
        "character": "JACK",
        "line": "What do you want to talk about?"
      },
      {
        "character": "WENDY (OFF)",
        "line": "I can't really remember."
      },
      {
        "character": "JACK",
        "line": "You can't remember."
      },
      {
        "character": "WENDY (OFF)",
        "line": "No, I can't."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - JACK'S APARTMENT - M.S.",
    "description": " DANNY sitting at table.  CAMERA TRACKS IN on him.",
    "dialogue": [
      {
        "character": "JACK (OFF)",
        "line": "Maybe it was about Danny.  Maybe it was about him."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - LOBBY - M.S.",
    "description": " Blood clear from camera lens revealing furniture floating about on river of blood.",
    "dialogue": [
      {
        "character": "JACK (OFF)",
        "line": "I think we should discuss Danny."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - CORRIDOR - M.S.",
    "description": " Low Angle Door with word \"MURDER\" scrawled in reverse on door.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - LOBBY - M.S.",
    "description": " Furniture floating on river of blood towards camera.",
    "dialogue": [
      {
        "character": "JACK (OFF)",
        "line": "I think... we should discuss what should be done with him."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - LOUNGE - M.S.",
    "description": " JACK moves forward. M.S. WENDY holding bat gives nervous laugh. 111. M.S. JACK moves forward R-L - CAMERA PANS & TRACKS BACK with him. M.S. WENDY holding bat moves back R-L.  CAMERA PANS with her. She weeps. M.S. WENDY holding bat. 112. M.S. WENDY holding bat. M.S. JACK moves forward - CAMERA TRACKS BACK before him. M.S. WENDY holding bat moves back. M.S. JACK moves forward.  CAMERA TRACKS BACK before him. M.S. WENDY holding bat moves back. M.S. JACK points to himself as he moves forward. M.S. WENDY holding bat moves backwards. 113. M.S. JACK moves forward.  CAMERA TRACKS BACK before him.  He points to himself and gestures. M.S. WENDY holding bat moves backwards. M.S. JACK moves forward - CAMERA TRACKS BACK before him. M.S. WENDY holding bat moves backwards L-R to foot of stairs. CAMERA PANS with her.  She moves onto first step. 114. M.S. JACK moves forward L-R.  CAMERA PANS with him. M.S. WENDY holding bat backs up stairs. JACK moves in cam.R.f.g. WENDY swinging bat before her backs up stairs.  JACK moves after her.  CAMERA TRACKS FORWARD after them. WENDY sobs. M.S. High Angle JACK over WENDY.  He moves forward up stairs. She backs away.  CAMERA TRACKS BACK and UP before them. 115. JACK reaches up to her. WENDY swings bat in front of her as she backs up stairs. WENDY waves bat in front of her.  JACK laughs. M.S. Low Angle WENDY swinging bat in front of her, backs up stairs.  JACK follows her - CAMERA TRACKS FORWARD after them. M.S. High Angle JACK over WENDY.  She swings bat in front of her, as she backs away and he follows her. 116. M.S. Low Angle WENDY over JACK.  CAMERA TRACKS FORWARD as they come up stairs. M.S. High Angle JACK over WENDY.  She swings bat in front of her as they move up stairs.  CAMERA TRACKS with them. 117. JACK reaches up with hand.  WENDY hits his hand with bat. SHE SCREAMS.  HE YELLS and grabs his wrist. M.S. Low Angle WENDY over JACK. WENDY hits JACK on head with bat. M.S. High Angle JACK over WENDY - he throws up hand and leans back. M.L.S. Low Angle WENDY over JACK.  He falls backwards down stairs.  CAMERA PANS L-R with him as he somersaults down stairs, stopping face down on half landing. M.L.S. High Angle WENDY back to camera at top of stairs. JACK lying facedown on half landing.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "What should be done with him?"
      },
      {
        "character": "WENDY (OFF)",
        "line": "I don't know."
      },
      {
        "character": "JACK",
        "line": "I don't think that's true.  I think you have some very definite ideas about what should be done with Danny... and I'd like to know what they are."
      },
      {
        "character": "WENDY",
        "line": "Well I... I think maybe he should be taken to a doctor."
      },
      {
        "character": "JACK",
        "line": "You think maybe he should be taken to a doctor?"
      },
      {
        "character": "WENDY",
        "line": "Yes..."
      },
      {
        "character": "JACK",
        "line": "When do you think maybe he should be taken to a doctor?"
      },
      {
        "character": "WENDY",
        "line": "As soon as possible?"
      },
      {
        "character": "JACK",
        "line": "As soon as possible."
      },
      {
        "character": "WENDY (OFF)",
        "line": "Jack..."
      },
      {
        "character": "WENDY",
        "line": "...please..."
      },
      {
        "character": "JACK",
        "line": "You believe his health might be at stake?"
      },
      {
        "character": "WENDY",
        "line": "Ye...yes."
      },
      {
        "character": "JACK",
        "line": "And you are concerned about him?"
      },
      {
        "character": "WENDY",
        "line": "Yes."
      },
      {
        "character": "JACK",
        "line": "And are you concerned about me?"
      },
      {
        "character": "WENDY",
        "line": "Of course I am."
      },
      {
        "character": "JACK (OFF)",
        "line": "Of course you are."
      },
      {
        "character": "JACK",
        "line": "Have you ever thought about my responsibilities?"
      },
      {
        "character": "WENDY (OFF)",
        "line": "Oh Jack, what are you talking about?"
      },
      {
        "character": "JACK",
        "line": "Have you ever had a single moment's thought about my responsibilities? Have you ever thought for a single solitary moment about my responsibilities to my employers?"
      },
      {
        "character": "JACK",
        "line": "Has it ever occurred to you that I have agreed to look after the Overlook Hotel until May the first? Does it matter to you at all that the owners have placed their complete confidence and trust in me, and that I have signed a letter of agreement, a contract, in which I have accepted that responsibility?"
      },
      {
        "character": "JACK (OFF)",
        "line": "Do you have the slightest idea what a moral and ethical principal is? Do you?"
      },
      {
        "character": "JACK",
        "line": "Has it ever occurred to you what would happen to my future, if I were to fail to live up to my responsibilities?"
      },
      {
        "character": "JACK (OFF)",
        "line": "Has it ever occurred to you?"
      },
      {
        "character": "JACK",
        "line": "Has it?"
      },
      {
        "character": "WENDY",
        "line": "Stay away from me!"
      },
      {
        "character": "JACK",
        "line": "Why?"
      },
      {
        "character": "WENDY",
        "line": "I just want to go back to my room."
      },
      {
        "character": "JACK",
        "line": "Why?"
      },
      {
        "character": "WENDY",
        "line": "Well... I'm very confused, and I just need a chance to think things over."
      },
      {
        "character": "JACK",
        "line": "You've had your whole fucking life to think things over - what's good a few minutes more going to do you now?"
      },
      {
        "character": "WENDY",
        "line": "Jack... stay away from me... please."
      },
      {
        "character": "WENDY",
        "line": "Don't hurt me!  Don't hurt me!"
      },
      {
        "character": "JACK",
        "line": "I'm not going to hurt you."
      },
      {
        "character": "WENDY",
        "line": "Stay away from me,"
      },
      {
        "character": "JACK",
        "line": "Wendy!"
      },
      {
        "character": "WENDY",
        "line": "Stay away...!"
      },
      {
        "character": "JACK",
        "line": "Darling, light of my life, I'm not going to hurt you.  You didn't let me finish my sentence.  I said 'I'm not going to hurt you... I'm just going to bash your brains in!'  I'm going to bash them right the fuck in."
      },
      {
        "character": "WENDY",
        "line": "Stay away from me!"
      },
      {
        "character": "WENDY",
        "line": "Stay away from me!"
      },
      {
        "character": "JACK",
        "line": "I'm not going to hurt you."
      },
      {
        "character": "WENDY",
        "line": "Stay away from me!"
      },
      {
        "character": "WENDY",
        "line": "Stay away from me!  Please..."
      },
      {
        "character": "JACK",
        "line": "Stop swinging the bat."
      },
      {
        "character": "WENDY",
        "line": "Stay away from me."
      },
      {
        "character": "JACK",
        "line": "Put the bat down, Wendy."
      },
      {
        "character": "WENDY",
        "line": "Stop it!"
      },
      {
        "character": "JACK",
        "line": "Wendy give me the bat."
      },
      {
        "character": "WENDY",
        "line": "Stay... stay away!"
      },
      {
        "character": "JACK",
        "line": "Give me the bat."
      },
      {
        "character": "WENDY",
        "line": "Stay away from me."
      },
      {
        "character": "JACK",
        "line": "Give me the bat."
      },
      {
        "character": "WENDY",
        "line": "Jack, stay away from me!"
      },
      {
        "character": "JACK",
        "line": "Stop swinging the bat."
      },
      {
        "character": "WENDY",
        "line": "Get down."
      },
      {
        "character": "JACK",
        "line": "Give me the bat."
      },
      {
        "character": "WENDY",
        "line": "Go away from me."
      },
      {
        "character": "JACK",
        "line": "Wendy..."
      },
      {
        "character": "WENDY",
        "line": "Go away."
      },
      {
        "character": "JACK",
        "line": "Give me the bat."
      },
      {
        "character": "WENDY",
        "line": "Go away."
      },
      {
        "character": "JACK",
        "line": "Give me the bat."
      },
      {
        "character": "JACK",
        "line": "Goddamn!"
      },
      {
        "character": "WENDY",
        "line": "Oh...oh!"
      }
    ]
  },
  {
    "scene": "INT. HOTEL - KITCHEN - M.C.S.",
    "description": " JACK lying on his back on floor.  He GROANS as he is dragged along R-L.  CAMERA TRACKS with him. 118.",
    "dialogue": []
  },
  {
    "scene": "INT. OVERLOOK HOTEL - KITCHEN - M.S.",
    "description": " WENDY, holding JACK's ankles, drags him backwards to food store door.  She undoes bolt, then tries to open door.  JACK M.S. Low Angle WENDY tugging at handle.  JACK GROANS OFF. M.C.S. WENDY tugging at handle.  She looks down cam.R. M.C.S. JACK, lying on his back on the floor GROANING, starts to come to.  His eyes open and he lifts his head up. M.C.S. WENDY, tugging at door handle. M.C.S. WENDY's hand on handle.  She takes out pin on chain in handle and tugs handle open. M.S. WENDY swings door open.  Then she takes hold of JACK's ankles. M.S. WENDY pulling JACK by the legs into food store. M.S. High Angle JACK on his back being dragged through door into food store. 119. WENDY puts his feet down and moves away to door. M.S. Low Angle WENDY's feet and legs move forward from JACK - She exits cam.R.f.g.  JACK rolls over onto his elbow. Door closes in f.g. M.S. JACK on floor in f.g.  WENDY in b.g. closes the door. JACK gets onto his feet.  He GROANS and grips his R. ankle, staggering against cardboard boxes.  They fall down onto him.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Hey... what are you doing?"
      },
      {
        "character": "JACK",
        "line": "Ohhh... what are you doing?"
      },
      {
        "character": "JACK",
        "line": "Hey, wait a minute... What are you doing?"
      },
      {
        "character": "JACK",
        "line": "What are you doing?"
      }
    ]
  },
  {
    "scene": "INT. HOTEL KITCHEN - M.S.",
    "description": " WENDY puts pin in handle, and backs L-R away from door. CAMERA PANS with her. WENDY turns away and looks about. WENDY sees knife in rack on wall and lifts it out of rack. She turns to face food store door. WENDY backs away to table. WENDY, resting one hand on table, weeps as she sinks to her knees. 120.",
    "dialogue": [
      {
        "character": "JACK (OFF)",
        "line": "Hey, wait a minute!"
      },
      {
        "character": "JACK (OFF)",
        "line": "What are you doing?"
      },
      {
        "character": "JACK (OFF)",
        "line": "Open the door."
      },
      {
        "character": "JACK (OFF)",
        "line": "Goddamit!  Let me out of here! Open the goddam door."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - FOOD STORE ROOM - M.C.S.",
    "description": " Low Angle - JACK.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Wendy, listen.  Let me out of here and I'll forget the whole goddam thing.  It'll be just like nothing ever happened."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - KITCHEN - M.S.",
    "description": " WENDY kneeling by table.  She is weeping and puts her hand up to her head.",
    "dialogue": []
  },
  {
    "scene": "INT. FOOD STORE ROOM - M.C.S.",
    "description": " Low Angle JACK listens to her weeping. He puts hand up to head. He takes his hand away from his head.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Wendy, baby..."
      },
      {
        "character": "JACK",
        "line": "I think you hurt my head real bad."
      },
      {
        "character": "JACK",
        "line": "I'm dizzy.  I need a doctor."
      }
    ]
  },
  {
    "scene": "INT. KITCHEN - M.S.",
    "description": " WENDY weeping as she kneels by table. WENDY stands up.  CAMERA TILTS UP with her. WENDY walks R-L.  CAMERA PANS with her to food store room door. 121. She weeps.",
    "dialogue": [
      {
        "character": "JACK (OFF)",
        "line": "Honey... don't leave me in here."
      },
      {
        "character": "WENDY",
        "line": "I'm gonna go now -"
      },
      {
        "character": "WENDY",
        "line": "I'm going to try and get... get Danny down to the Sidewinder... in the Snowcat today."
      },
      {
        "character": "WENDY",
        "line": "I'll bring back a doctor."
      }
    ]
  },
  {
    "scene": "INT. FOOD STORE ROOM - M.C.S.",
    "description": "",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Wendy..."
      },
      {
        "character": "WENDY (OFF)",
        "line": "I'm gonna go now."
      },
      {
        "character": "JACK",
        "line": "Wendy..."
      }
    ]
  },
  {
    "scene": "INT. KITCHEN - M.S.",
    "description": " WENDY weeping turns to food store door.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Yes?"
      }
    ]
  },
  {
    "scene": "INT. FOOD STORE ROOM - M.C.S.",
    "description": " JACK smiling. He laughs. He laughs. 122.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "You've got a big surprise coming to you."
      },
      {
        "character": "JACK",
        "line": "You're not going anywhere."
      }
    ]
  },
  {
    "scene": "INT. KITCHEN - M.S.",
    "description": " WENDY by food store door. He laughs off. He laughs off.  WENDY exits cam.L.",
    "dialogue": [
      {
        "character": "JACK (OFF)",
        "line": "Go check out the Snowcat and the radio and see what I mean."
      },
      {
        "character": "JACK (OFF)",
        "line": "Go check it out!"
      }
    ]
  },
  {
    "scene": "INT. FOOD STORE ROOM - M.C.S.",
    "description": " JACK laughing. He laughs. He laughs.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Go check it out!"
      },
      {
        "character": "JACK",
        "line": "Go check it out!"
      }
    ]
  },
  {
    "scene": "INT. HOTEL - CORRIDOR - M.L.S.",
    "description": " WENDY carrying knife runs forward - CAMERA PANS L-R with her as she runs to door.  She forces it open.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - M.L.S.",
    "description": " WENDY forces door open against snow and walks out on snow. CAMERA PANS L-R with her to edge of porch.  She runs away to b.g. M.L.S. WENDY runs L-R along front of hotel - CAMERA TRACKS with her. 123.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - GARAGE - M.S.",
    "description": " Snowcat in garage.  WENDY seen through open doorway.  She runs forward and enters garage, carrying knife.  She stops at entrance.  Then she moves L-R towards Snowcat, and picks up distributor cap.  CAMERA TRACKS IN on her, reacting to damaged distributor cap. Superimposed over: 4 p.m.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - L.S.",
    "description": " Overlook Hotel in b.g.  Snow and trees in f.g.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - FOOD STORE ROOM - M.C.S.",
    "description": " JACK asleep on sacks.  CAMERA TRACKS BACK.  KNOCK ON DOOR OFF.  JACK stirs and rubs his eyes.  KNOCK ON DOOR OFF. Jack sits up. CAMERA TRACKS BACK as JACK feels his R. ankle. JACK puts his hand up on shelf. JACK stands up and moves R-L behind shelves towards door. CAMERA TRACKS with him. JACK moves R-L to door and leans on it with his hand. 124. M.C.S. JACK by door. He moves back R-L from door. He puts his hand up to his head. He lowers his hand from his head. JACK laughs. 125. JACK nods his head. SOUND OF BOLT BEING DRAWN & HANDLE BEING UNFASTENED OFF.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Wendy?"
      },
      {
        "character": "GRADY (OFF)",
        "line": "It's Grady, Mr. Torrance.  Delbert Grady."
      },
      {
        "character": "JACK",
        "line": "Grady... oh."
      },
      {
        "character": "JACK",
        "line": "Oh Grady... right.  Grady... er..."
      },
      {
        "character": "JACK",
        "line": "Hullo Grady."
      },
      {
        "character": "GRADY (OFF)",
        "line": "Mr. Torrance, I see you can hardly have taken care of the..."
      },
      {
        "character": "GRADY (OFF)",
        "line": "business we discussed."
      },
      {
        "character": "JACK",
        "line": "No need to rub it in, Mr. Grady. I'll deal with that situation as soon as I get out of here."
      },
      {
        "character": "GRADY (OFF)",
        "line": "Will you indeed, Mr. Torrance."
      },
      {
        "character": "GRADY (OFF)",
        "line": "I wonder.  I have my doubts."
      },
      {
        "character": "GRADY (OFF)",
        "line": "I and others have come to believe... that your heart is not in this, that you haven't the belly for it."
      },
      {
        "character": "JACK",
        "line": "Just give me one more chance to prove it, Mr. Grady.  That's all I ask."
      },
      {
        "character": "GRADY (OFF)",
        "line": "Your wife appears to be stronger than we imagined, Mr. Torrance. Somewhat more resourceful, she seems to have got the better of you."
      },
      {
        "character": "JACK",
        "line": "For the moment, Mr. Grady.  Only for the moment."
      },
      {
        "character": "GRADY (OFF)",
        "line": "I fear that you will have to deal with this matter in the harshest possible way, Mr. Torrance.  I fear that is the only thing to do."
      },
      {
        "character": "JACK",
        "line": "There's nothing I look forward to with the greater pleasure, Mr. Grady."
      },
      {
        "character": "GRADY (OFF)",
        "line": "You give your word on that do you, Mr. Torrance?"
      },
      {
        "character": "JACK",
        "line": "I give you my word."
      }
    ]
  },
  {
    "scene": "EXT. ROAD - NIGHT - L.S.",
    "description": " HALLORAN driving Snowcat forward along snow-covered road between banks of trees.",
    "dialogue": []
  },
  {
    "scene": "INT. HALLORAN'S SNOWCAT - M.C.S.",
    "description": " HALLORAN driving Snowcat L-R along road. M.S. Shooting from behind HALLORAN sitting cam.L through windscreen, with wipers working, as he moves forward along snow-covered road.  Trees on either side of road.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - JACK'S APARTMENT - NIGHT - M.C.S.",
    "description": " DANNY moves away R-L towards his MOTHER asleep in bed. CAMERA PANS with him. DANNY stops beside WENDY asleep in bed. 126. WENDY stirs in bed.  DANNY reaches out with his hand for knife on table cam.R of bed. DANNY holds up knife. He feels blade. He takes hand away from blade. He turns away from bed and holding knife up walks L-R. CAMERA PANS with him. He stops by dressing table. He picks up lipstick from dressing table. He turns away from dressing table. DANNY walks R-L away to door - CAMERA PANS with him. 127.",
    "dialogue": [
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum.  Red Rum.  Red Rum.  Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum.  Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum.  Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum.  Red Rum.  Red Rum.  Red Rum.  Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum.  Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum.  Red Rum.  Red Rum."
      }
    ]
  },
  {
    "scene": "INT. OVERLOOK HOTEL - JACK'S APARTMENT - NIGHT - M.S.",
    "description": " DANNY holding knife and lipstick at door.  WENDY asleep in bed in b.g. He starts to write with lipstick the word \"MURDER\" IN reverse on the door. He finishes writing word and looks at word. He turns and walks away to WENDY asleep in bed. WENDY wakes and sits up with a SHRIEK. M.S. DANNY beside WENDY in bed. WENDY gets out of bed and takes knife away from him. WENDY puts her arms round DANNY and pulls him towards her. She looks over his shoulder. She reacts - CAMERA ZOOMS IN on her face. 128. M.S. WENDY's P.O.V.  The word \"MURDER\" written by DANNY on door - reflected in mirror.  CAMERA ZOOMS IN on word.  SOUND OF AXE STRIKING DOOR OFF. M.C.S. WENDY shrieks and looks cam.L.  She puts her hand up to DANNY's head.",
    "dialogue": [
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum.  Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum.  Red Rum.  Red Rum.  Red Rum.  Red Rum.  Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum.  Red Rum."
      },
      {
        "character": "TONY'S VOICE",
        "line": "Red Rum.  Red Rum.  Red Rum."
      },
      {
        "character": "DANNY",
        "line": "Red Rum.  Red Rum.  Red Rum."
      },
      {
        "character": "WENDY",
        "line": "Danny.  Danny, stop it.  Danny!"
      },
      {
        "character": "DANNY",
        "line": "Red Rum.  Red Rum.  Red Rum.  Red Rum."
      },
      {
        "character": "WENDY",
        "line": "Eh..."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - CORRIDOR - M.S.",
    "description": " JACK swings axe at front door of his apartment.",
    "dialogue": []
  },
  {
    "scene": "INT. JACK'S APARTMENT - M.S.",
    "description": " WENDY holding DANNY in her arms gets up off bed.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - CORRIDOR - M.S.",
    "description": " JACK swings axe at front door of apartment.",
    "dialogue": []
  },
  {
    "scene": "INT. JACK'S APARTMENT - M.S.",
    "description": " WENDY, with DANNY in her arms, looks about, then moves to door with \"MURDER\" in reverse written on it.  She opens door and goes into bathroom, with DANNY, closing door behind her.",
    "dialogue": []
  },
  {
    "scene": "INT. BATHROOM - M.S.",
    "description": " WENDY, with DANNY clinging to her, closes the door.  Then she bolts and locks it.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL CORRIDOR - M.S.",
    "description": " JACK swings axe at door and splinters a panel.",
    "dialogue": []
  },
  {
    "scene": "INT. BATHROOM - M.S.",
    "description": " WENDY & DANNY move R-L from door to window.  She drops knife in basin as she passes it.  CAMERA PANS with them. 129. WENDY unbolts window and raises the bottom part.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - M.S.",
    "description": " WENDY tries to force bottom part of window higher up.",
    "dialogue": []
  },
  {
    "scene": "INT. BATHROOM - M.C.S.",
    "description": " DANNY clinging to WENDY looks over his shoulder as he hears axe splintering door OFF.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL CORRIDOR - M.S.",
    "description": " JACK swings axe at splintered panel on door.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL BATHROOM WINDOW - M.S.",
    "description": " WENDY looking out of window. L.S. HOTEL.  WENDY at bathroom window.  She draws back into bathroom.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL CORRIDOR - M.S.",
    "description": " JACK swings axe at splintered panel on door.",
    "dialogue": []
  },
  {
    "scene": "INT. JACK'S APARTMENT - M.S.",
    "description": " JACK pulls piece of wood away from splintered panel, and looks through gap. M.C.S. JACK at gap in panel. 130. He looks down.  CAMERA TILTS DOWN - he removes a piece of wood with hand and then reaches in and unlocks door.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Wendy, I'm home."
      }
    ]
  },
  {
    "scene": "INT. BATHROOM - M.S.",
    "description": " WENDY, back to camera, lifts DANNY up to open window.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - L.S.",
    "description": " WENDY pushes DANNY out through open window onto snow.  She lets him go and he slides L-R down snow.  He stands up at the bottom, and looks up at WENDY at window. M.S. WENDY struggling to get out of open window.",
    "dialogue": []
  },
  {
    "scene": "INT. JACK'S APARTMENT - M.S.",
    "description": " JACK, carrying axe, moves up stairs from open front door. CAMERA TRACKS BACK with him.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - M.S.",
    "description": " WENDY struggling to get out of bathroom window.  She goes back into bathroom. M.S. DANNY looking up cam.L at bathroom window.",
    "dialogue": []
  },
  {
    "scene": "INT. JACK'S APARTMENT - BEDROOM - M.S.",
    "description": " JACK, carrying axe, walks away across Living Room into Bedroom.  CAMERA TRACKS after him. 131.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Come out, come out, wherever you are!"
      }
    ]
  },
  {
    "scene": "INT. BATHROOM - M.S.",
    "description": " WENDY trying to force window up higher.  She looks over her shoulder, then puts her head down to open window.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - M.S.",
    "description": " WENDY tries to get out of open window.",
    "dialogue": []
  },
  {
    "scene": "INT. BEDROOM - M.C.S.",
    "description": " JACK enters cam.R.  He stops at Bathroom door.  HE RAPS ON",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - M.S.",
    "description": " WENDY with head out of open Bathroom window. L.S. WENDY at Bathroom window cam.L.  DANNY at foot of slope of snow looking up cam.L. DANNY runs away L-R.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Danny, I can't get out!"
      },
      {
        "character": "WENDY",
        "line": "Run, run and hide.  Run, quick!"
      }
    ]
  },
  {
    "scene": "INT. BEDROOM - M.C.S.",
    "description": " JACK at Bathroom door.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Little pigs, little pigs, let me come in!"
      }
    ]
  },
  {
    "scene": "INT. BATHROOM - M.S.",
    "description": " WENDY by open window.  She moves L-R to basin.  CAMERA PANS with her.  She picks up knife and moves R-L to side of door. 132. CAMERA PANS with her.",
    "dialogue": []
  },
  {
    "scene": "INT. BEDROOM - M.C.S.",
    "description": " JACK at Bathroom door. M.S. JACK holding axe back to camera at Bathroom door. He swings axe back. M.S. JACK swings axe twice at Bathroom door.  WENDY SCREAMS",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Not by the hair on your chiny, chin, chin.  Then I'll huff, and I'll puff"
      },
      {
        "character": "JACK (CONT'D)",
        "line": "and I'll blow your house in."
      }
    ]
  },
  {
    "scene": "INT. BATHROOM - M.S.",
    "description": " WENDY standing at side of door.  JACK's axe appear through door.  WENDY SCREAMS.  JACK's axe repeatedly appears and splinters door.  WENDY screams. Head of axe appears through splintered door.  WENDY SCREAMS. Head of axe appears again through door.  WENDY SCREAMS. M.C.S. Splintered door panel. 133. JACK in b.g. swings axe at door and smashes away the splintered wood.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Jack.  Please.  Don't... Don't..."
      },
      {
        "character": "WENDY",
        "line": "Don't!  Oh!  Please"
      },
      {
        "character": "WENDY",
        "line": "Stop!"
      },
      {
        "character": "WENDY (OFF)",
        "line": "Jack!"
      },
      {
        "character": "WENDY (OFF)",
        "line": "Stop it!  Stop it!"
      }
    ]
  },
  {
    "scene": "INT. BEDROOM - M.S.",
    "description": " JACK swings axe at splintered door. JACK moves L-R to gap in splintered door.  WENDY SCREAMS OFF.",
    "dialogue": [
      {
        "character": "WENDY (OFF)",
        "line": "Stop it!"
      }
    ]
  },
  {
    "scene": "INT. BATHROOM - M.C.S.",
    "description": " JACK's face at gap in splintered door. M.C.S. WENDY holding knife SCREAMS. M.C.S. JACK's smiling face at gap in splintered door.  He moves backwards and reaches in through gap. M.C.S. JACK's hand in through gap in door to key on inside of door. M.S. WENDY strikes down with knife. M.C.S. JACK's hand on key.  WENDY's knife slashes across back of his hand, and withdraws cam.R.  JACK's hand moves to gap in door.  JACK YELLS OFF. 134. M.C.S. JACK's face at gap in door.  HE IS YELLING.  He looks down and turns away from door.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Here's Johnny!"
      }
    ]
  },
  {
    "scene": "EXT. ROAD - NIGHT - M.S.",
    "description": " Shooting from behind HALLORAN sitting back to camera L.f.g. through windscreen as he drives along snow-covered road.",
    "dialogue": []
  },
  {
    "scene": "INT. BATHROOM - M.S.",
    "description": " WENDY at side of door.  She looks cam.R as she hears HALLORAN's Snowcat approaching OFF.",
    "dialogue": []
  },
  {
    "scene": "INT. BEDROOM - M.C.S.",
    "description": " JACK at Bathroom door - he turns round as he hears HALLORAN's Snowcat approaching OFF.  He looks down cam.L.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - NIGHT - L.S.",
    "description": " HALLORAN's Snowcat moves R-L along snow-covered road. CAMERA TRACKS with it revealing Overlook Hotel in b.g.",
    "dialogue": []
  },
  {
    "scene": "INT. BEDROOM - M.C.S.",
    "description": " JACK looking cam.R.  He turns away to splintered door.",
    "dialogue": []
  },
  {
    "scene": "INT. BATHROOM - M.C.S.",
    "description": " WENDY at side of door listening.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - L.S.",
    "description": " HALLORAN's Snowcat moves R-L along front of Hotel.  CAMERA TRACKS with it.  Snowcat stops. 135.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL CORRIDOR - KITCHEN - M.L.S.",
    "description": " DANNY runs forward along corridor.  CAMERA TRACKS BACK before him.  He runs into kitchen - stops and moves L-R to oven.  He kneels down beside it.  CAMERA PANS with him. DANNY slides oven door open R-L and crawls into it. M.C.S. DANNY in oven slides door R-L. M.S. Oven door sliding L-R. M.S. JACK holding axe limps R-L through kitchen.  CAMERA TRACKS with him.",
    "dialogue": []
  },
  {
    "scene": "INT. BATHROOM - M.S.",
    "description": " WENDY sobbing at side of door - then she moves to door and slashes at it with knife.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - M.L.S.",
    "description": " HALLORAN walking R-L.  CAMERA TRACKS with him.  He moves to door left open by WENDY.  He pulls it open wide and exits into Hotel.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - LOBBY - M.S.",
    "description": " JACK holding axe moves forward - CAMERA PANS R-L and TRACKS with him.  He moves away up stairs. JACK at top of stairs. JACK moves away from stairs CAMERA TRACKS after him.  JACK moves R-L and looks down at Lobby.  CAMERA TRACKS after him. 136. M.L.S. HALLORAN moves forward along corridor.  CAMERA TRACKS HALLORAN moves R-L to entrance to Lobby. HALLORAN moves away into Lobby.  CAMERA TRACKS FORWARD after him. JACK, holding axe, YELLS as he steps from behind pillar cam.R and moves towards HALLORAN. M.S. JACK YELLING as he swings axe at HALLORAN. M.C.S. HALLORAN's chest - axe pierces raincoat and blood oozes out. M.C.S. DANNY, with his mouth wide open. M.S. JACK over HALLORAN.  JACK holding onto shaft of axe. M.C.S. HALLORAN, with his mouth wide open. M.C.S. DANNY, with his mouth wide open. 137. M.S. JACK over HALLORAN, holding onto shaft of axe. M.C.S. HALLORAN, with his mouth wide open, sinks down out of shot. M.C.S. DANNY, with his mouth wide open. M.C.S. JACK rises up into shot. M.L.S. JACK holding axe standing beside body of HALLORAN on floor.  JACK limps forward.  CAMERA TRACKS BACK before him. He stops at corridor to kitchen. M.L.S. JACK back to camera in R.f.g.  DANNY climbs out of oven in b.g.  JACK moves forward.  DANNY exits cam.R.f.g. JACK limps away.  CAMERA TRACKS IN after him.",
    "dialogue": [
      {
        "character": "HALLORAN (OFF)",
        "line": "Hallo!"
      },
      {
        "character": "HALLORAN (OFF)",
        "line": "Anybody here?"
      },
      {
        "character": "HALLORAN (OFF)",
        "line": "Hallo!  Anybody here?"
      },
      {
        "character": "HALLORAN",
        "line": "Hallo!"
      },
      {
        "character": "HALLORAN",
        "line": "Anybody here?"
      },
      {
        "character": "HALLORAN",
        "line": "Hallo!  Hallo!  Anybody here?"
      },
      {
        "character": "JACK",
        "line": "Danny!  Danny boy!"
      },
      {
        "character": "JACK",
        "line": "Danny!"
      },
      {
        "character": "JACK",
        "line": "Danny!  Danny!"
      }
    ]
  },
  {
    "scene": "INT. HOTEL - STAIRS - M.S.",
    "description": " High Angle WENDY runs up stairs L-R.  She pauses on landing. CAMERA TRACKS BACK before WENDY as she goes up next flight of stairs.  She stops at top of stairs and looks along landing. M.L.S. WENDY'S P.O.V.  Shooting along landing into open doorway of bedroom. 138. MAN, dressed in Dog's costume, kneeling at foot of bed.  He leans back and looks towards her.  MAN, in evening dress, leans forward and looks at WENDY.  CAMERA ZOOMS IN on them. M.S. WENDY, holding knife, at top of stairs backs away - then turns and runs away along corridor, exiting cam.L at end.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Danny!"
      }
    ]
  },
  {
    "scene": "INT. LOBBY - M.L.S.",
    "description": " JACK, holding axe, limps forward and moves L-R through entrance.  He walks away to open door.  CAMERA TRACKS after him.  He stops in doorway.",
    "dialogue": []
  },
  {
    "scene": "EXT. OVERLOOK HOTEL - NIGHT - M.L.S.",
    "description": " Shooting from door.  HALLORAN's Snowcat in b.g.  CAMERA PANS",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - LOBBY - M.S.",
    "description": " JACK, holding axe, at open doorway.  He comes in and moves L-R to switch panel on wall.  He opens cover and presses switches down.  He leans towards open doorway and watches lights going on outside.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - M.S.",
    "description": " DANNY crouched behind track of HALLORAN's Snowcat.  He peers round corner.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - M.S.",
    "description": " JACK limps to open doorway and stops. 139.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Danny!"
      }
    ]
  },
  {
    "scene": "EXT. HOTEL - M.S.",
    "description": " DANNY by track of HALLORAN's Snowcat.  He moves away L-R. M.L.S. JACK limps away from door. M.S. DANNY runs L-R and exits cam.R. M.S. JACK limping L-R from Hotel.  CAMERA TRACKS with him. M.L.S. DANNY running away L-R across snow.  CAMERA PANS with him.  He runs into Maze. M.S. JACK limping L-R.  CAMERA TRACKS with him.  Hotel in b.g.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Danny!"
      },
      {
        "character": "JACK",
        "line": "Danny!"
      }
    ]
  },
  {
    "scene": "EXT. HOTEL - MAZE - M.S.",
    "description": " DANNY running away through Maze.  CAMERA TRACKS after him. He looks back over his shoulder. M.S. JACK in the Maze.  He limps forward.  CAMERA TRACKS BACK before him. He looks down. M.C.S. DANNY's footprints in snow.  CAMERA TILTS UP & TRACKS FORWARD along DANNY's footprints. 140. M.C.S. DANNY's feet and legs running away through Maze.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Danny!  I'm coming.  I'm coming Dan!"
      }
    ]
  },
  {
    "scene": "INT. HOTEL - M.L.S.",
    "description": " WENDY, carrying knife, runs forward into kitchen.  She looks towards stairs in b.g. WENDY stumbles forward through coffee pots and rings on floor.  CAMERA TRACKS BACK before her. WENDY turns R-L.  CAMERA TRACKS with her.  She moves away along corridor.  CAMERA TRACKS after her.  She stops at corner.  CAMERA CONTINUES PAST her revealing HALLORAN lying dead on floor of lobby. M.C.S. WENDY reacts. M.L.S. HALLORAN's body lying on floor.  CAMERA ZOOMS IN on it. M.C.S. WENDY looks about.  She moves away R-L.  CAMERA PANS with her.  She SCREAMS and turns to cam.R.  CAMERA WHIP PANS L-R onto M.L.S. INJURED GUEST. M.S. WENDY reacting - knife trembles in her hand. M.C.S. INJURED GUEST, with scar running down his head and face.  He raises glass he is holding. 141. M.S. WENDY SCREAMING turns and runs away.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Danny!"
      },
      {
        "character": "WENDY",
        "line": "Oh!"
      },
      {
        "character": "INJURED GUEST",
        "line": "Great party, isn't it?"
      }
    ]
  },
  {
    "scene": "EXT. HOTEL - MAZE - M.L.S.",
    "description": " DANNY running away through Maze.  CAMERA TRACKS after him. M.S. JACK limps forward in Maze.  CAMERA TRACKS BACK before him.",
    "dialogue": [
      {
        "character": "JACK (OFF)",
        "line": "Danny!  Danny!  I'm coming!"
      },
      {
        "character": "JACK",
        "line": "You can't get away.  I'm right behind you."
      }
    ]
  },
  {
    "scene": "INT. HOTEL - CORRIDOR & LOUNGE - M.L.S.",
    "description": " WENDY runs forward. WENDY runs forward and then moves R-L.  CAMERA PANS with her - she stops cam.R.f.g. and SCREAMS. M.C.S. WENDY looking about. M.L.S. SKELETONS sitting in chairs.  Bottle of champagne on table in f.g. M.S. SKELETONS sitting at table with bottle and glasses on it. M.L.S. SKELETONS sitting in chairs round tables with bottles on them. 142.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Danny!"
      }
    ]
  },
  {
    "scene": "EXT. HOTEL - MAZE - M.L.S.",
    "description": " JACK limps away through Maze.  CAMERA TRACKS FORWARD after him. M.S. DANNY steps backwards in his footprints in snow. M.S. JACK limps forward laughing. M.L.S. DANNY stepping backwards in his footprints in snow. He jumps L-R landing in snow, and crawls L-R - brushing his traces in the snow out with his hands.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Danny!"
      }
    ]
  },
  {
    "scene": "INT. HOTEL - CORRIDOR - M.L.S.",
    "description": " WENDY holding knife runs forward.  She slows down as she nears f.g.  She moves R-L.  CAMERA PANS with her to open door.  She stops by doorway and looks along corridor towards lift doors in b.g. M.S. Lift doors.  Blood gushes in cam.L and surges forward along floor. M.C.S. WENDY reacts. M.S. Lift doors.  Blood gushes in cam.L and cam.R - surging forward in wave towards camera.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - MAZE - M.S.",
    "description": " DANNY sitting leaning against side of Maze.  CAMERA TRACKS R-L revealing JACK, holding axe, cam.R.b.g.  He limps R-L and moves away along Maze. 143. M.S. DANNY's footprints in the snow - CAMERA TRACKS FORWARD and stops when footprints end.  CAMERA TILTS UP to snow without footprints. M.C.S. JACK - he looks about then back and forwards - and finally cam.R. He looks cam.L. M.C.S. DANNY crouched against side of Maze. M.S. JACK - he looks about then cam.L. M.L.S. JACK limps L-R and exits cam.R. M.S. DANNY appears from behind mound of snow and moves forward R-L. M.L.S. DANNY's P.O.V.  Empty Maze. M.S. DANNY moves away R-L from mound of snow.  CAMERA PANS with him.  He runs away along Maze. M.S. Footprints in snow in Maze.  CAMERA TRACKS FORWARD along footprints. 144. M.L.S. JACK, back to camera, limping away along Maze. CAMERA TRACKS after him. M.S. JACK limps forward along Maze.  CAMERA TRACKS BACK before him. M.S. CAMERA TRACKS FORWARD along Maze. M.S. DANNY runs forward along Maze.  CAMERA TRACKS BACK. M.L.S. JACK moves to opening cam.R.  CAMERA TRACKS FORWARD - he turns and moves R-L to opening cam.L.  CAMERA PANS with him.  He stops and turns - then moves L-R.  CAMERA PANS with him and TRACKS after him as he limps along MAZE.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Danny!"
      },
      {
        "character": "JACK (OFF)",
        "line": "Danny!"
      },
      {
        "character": "JACK",
        "line": "Danny!"
      }
    ]
  },
  {
    "scene": "EXT. HOTEL - M.L.S.",
    "description": " WENDY sobbing and holding knife runs away to HALLORAN's Snowcat in b.g.  CAMERA TRACKS FORWARD after her.  She stops by Snowcat and looks about.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - MAZE - M.S.",
    "description": " DANNY runs forward in Maze.  CAMERA TRACKS BACK.  DANNY looks over his shoulder and falls down in snow at entrance.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - M.S.",
    "description": " WENDY standing by HALLORAN's Snowcat.  She throws down knife. She runs forward and out cam.R.f.g. M.L.S. DANNY lying on snow at entrance to Maze.  He gets up and runs R-L.  CAMERA PANS with him. 145. DANNY runs R-L into WENDY's arms as she kneels on snow. WENDY hugs and kisses DANNY.",
    "dialogue": [
      {
        "character": "WENDY",
        "line": "Danny!  Danny!"
      },
      {
        "character": "DANNY",
        "line": "Mommy..."
      },
      {
        "character": "WENDY (OFF)",
        "line": "Danny, come here!"
      },
      {
        "character": "DANNY",
        "line": "Mommy... Mommy...!"
      },
      {
        "character": "WENDY (OFF)",
        "line": "Danny!"
      },
      {
        "character": "DANNY",
        "line": "Mommy!"
      },
      {
        "character": "WENDY",
        "line": "Oh!"
      },
      {
        "character": "WENDY",
        "line": "Oh Danny!"
      }
    ]
  },
  {
    "scene": "EXT. HOTEL - MAZE - M.S.",
    "description": " JACK holding axe limps forward - CAMERA TRACKS BACK.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Danny!  Where..."
      }
    ]
  },
  {
    "scene": "EXT. HOTEL - M.L.S.",
    "description": " WENDY holding DANNY moves R-L to HALLORAN's Snowcat.  CAMERA PANS with them.  WENDY opens door of Snowcat and lifts DANNY up to cab.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - MAZE - M.L.S.",
    "description": " JACK GROANING staggers away along Maze - CAMERA TRACKS after him. 146. He stumbles and lies in snow.  He struggles up to his feet.",
    "dialogue": [
      {
        "character": "JACK",
        "line": "Danny!"
      }
    ]
  },
  {
    "scene": "EXT. HOTEL - L.S.",
    "description": " Snowcat with lights on moves R-L in front of Hotel, then turns to cam.R.  JACK SHOUTS INAUDIBLE OFF.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - MAZE - M.S.",
    "description": " JACK staggers forward.  CAMERA TRACKS BACK - INDISTINCT SHOUTS.  He GROANS as he moves forward R-L.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - L.S.",
    "description": " Snowcat drives away down road.  JACK INAUDIBLE SHOUTS OFF.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - MAZE - M.S.",
    "description": " JACK staggers forward along Maze.  CAMERA TRACKS BACK - M.L.S. JACK staggers away along Maze.  CAMERA TRACKS after him.  INDISTINCT MOANS.  He slumps down cam.L against side of Maze.",
    "dialogue": []
  },
  {
    "scene": "EXT. HOTEL - MAZE - DAY - M.C.S.",
    "description": " JACK sitting up to his chest in snow dead.  Snow and icicles on his face.",
    "dialogue": []
  },
  {
    "scene": "INT. HOTEL - GOLD BALLROOM - M.L.S.",
    "description": " Entrance to Gold Ballroom - CAMERA TRACKS FORWARD through entrance to photographs on wall.  CAMERA TRACKS IN close on photograph of Guests at Ball. 147. M.S. Photograph of Guests at Ball. M.C.S. Photograph of YOUNG MAN in dinner jacket.  CAMERA",
    "dialogue": [
      {
        "character": "OVERLOOK HOTEL",
        "line": "JULY 4th BALL 1921"
      }
    ]
  }
]